{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "NFD"
      },
      {
        "type": "StripAccents"
      },
      {
        "type": "Lowercase"
      }
    ]
  },
  "pre_tokenizer": {
    "type": "BertPreTokenizer"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      }
    ],
    "special_tokens": {
      "[CLS]": {
        "id": "[CLS]",
        "ids": [
          2
        ],
        "tokens": [
          "[CLS]"
        ]
      },
      "[SEP]": {
        "id": "[SEP]",
        "ids": [
          3
        ],
        "tokens": [
          "[SEP]"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "WordPiece",
    "unk_token": "[UNK]",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 100,
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "[MASK]": 4,
      "!": 5,
      "\"": 6,
      "#": 7,
      "$": 8,
      "%": 9,
      "&": 10,
      "'": 11,
      "(": 12,
      ")": 13,
      "*": 14,
      "+": 15,
      ",": 16,
      "-": 17,
      ".": 18,
      "/": 19,
      "0": 20,
      "1": 21,
      "2": 22,
      "3": 23,
      "4": 24,
      "5": 25,
      "6": 26,
      "7": 27,
      "8": 28,
      "9": 29,
      ":": 30,
      ";": 31,
      "<": 32,
      "=": 33,
      ">": 34,
      "?": 35,
      "@": 36,
      "[": 37,
      "\\": 38,
      "]": 39,
      "^": 40,
      "_": 41,
      "a": 42,
      "b": 43,
      "c": 44,
      "d": 45,
      "e": 46,
      "f": 47,
      "g": 48,
      "h": 49,
      "i": 50,
      "j": 51,
      "k": 52,
      "l": 53,
      "m": 54,
      "n": 55,
      "o": 56,
      "p": 57,
      "q": 58,
      "r": 59,
      "s": 60,
      "t": 61,
      "u": 62,
      "v": 63,
      "w": 64,
      "x": 65,
      "y": 66,
      "z": 67,
      "{": 68,
      "|": 69,
      "}": 70,
      "~": 71,
      "¦": 72,
      "©": 73,
      "®": 74,
      "°": 75,
      "·": 76,
      "º": 77,
      "ø": 78,
      "α": 79,
      "β": 80,
      "γ": 81,
      "δ": 82,
      "ε": 83,
      "θ": 84,
      "λ": 85,
      "μ": 86,
      "π": 87,
      "σ": 88,
      "φ": 89,
      "ω": 90,
      "а": 91,
      "в": 92,
      "и": 93,
      "н": 94,
      "с": 95,
      "෍": 96,
      "​": 97,
      "‍": 98,
      "–": 99,
      "—": 100,
      "’": 101,
      "“": 102,
      "”": 103,
      "•": 104,
      "…": 105,
      "ℎ": 106,
      "™": 107,
      "→": 108,
      "−": 109,
      "∴": 110,
      "≤": 111,
      "≥": 112,
      "⌈": 113,
      "⌉": 114,
      "⌊": 115,
      "⌋": 116,
      "─": 117,
      "═": 118,
      "▀": 119,
      "▄": 120,
      "█": 121,
      "░": 122,
      "▒": 123,
      "▓": 124,
      "■": 125,
      "□": 126,
      "▪": 127,
      "▬": 128,
      "▶": 129,
      "►": 130,
      "○": 131,
      "●": 132,
      "◕": 133,
      "★": 134,
      "☆": 135,
      "☒": 136,
      "☺": 137,
      "♂": 138,
      "♡": 139,
      "♥": 140,
      "♦": 141,
      "♪": 142,
      "♫": 143,
      "♬": 144,
      "✅": 145,
      "✓": 146,
      "✔": 147,
      "✨": 148,
      "❤": 149,
      "⠀": 150,
      "ツ": 151,
      "": 152,
      "": 153,
      "": 154,
      "𝑂": 155,
      "𝑘": 156,
      "𝑛": 157,
      "🇸": 158,
      "🇺": 159,
      "🍆": 160,
      "🎃": 161,
      "🎵": 162,
      "🎶": 163,
      "🏻": 164,
      "👀": 165,
      "👉": 166,
      "👌": 167,
      "👍": 168,
      "👏": 169,
      "💀": 170,
      "💕": 171,
      "💖": 172,
      "💜": 173,
      "💦": 174,
      "💩": 175,
      "💪": 176,
      "💯": 177,
      "💰": 178,
      "🔥": 179,
      "🗿": 180,
      "😀": 181,
      "😁": 182,
      "😂": 183,
      "😃": 184,
      "😄": 185,
      "😅": 186,
      "😆": 187,
      "😈": 188,
      "😉": 189,
      "😊": 190,
      "😋": 191,
      "😍": 192,
      "😎": 193,
      "😏": 194,
      "😐": 195,
      "😒": 196,
      "😔": 197,
      "😘": 198,
      "😛": 199,
      "😜": 200,
      "😞": 201,
      "😡": 202,
      "😢": 203,
      "😤": 204,
      "😩": 205,
      "😫": 206,
      "😬": 207,
      "😭": 208,
      "😱": 209,
      "😳": 210,
      "🙂": 211,
      "🙃": 212,
      "🙄": 213,
      "🙏": 214,
      "🚨": 215,
      "🤔": 216,
      "🤗": 217,
      "🤣": 218,
      "🤤": 219,
      "🤷": 220,
      "##0": 221,
      "##e": 222,
      "##c": 223,
      "##o": 224,
      "##d": 225,
      "##r": 226,
      "##v": 227,
      "##n": 228,
      "##s": 229,
      "##t": 230,
      "##a": 231,
      "##i": 232,
      "##l": 233,
      "##b": 234,
      "##u": 235,
      "##z": 236,
      "##y": 237,
      "##m": 238,
      "##p": 239,
      "##h": 240,
      "##g": 241,
      "##k": 242,
      "##w": 243,
      "##5": 244,
      "##f": 245,
      "##x": 246,
      "##2": 247,
      "##q": 248,
      "##j": 249,
      "##4": 250,
      "##7": 251,
      "##1": 252,
      "##8": 253,
      "##9": 254,
      "##3": 255,
      "##6": 256,
      "##‍": 257,
      "##♂": 258,
      "##𝑘": 259,
      "##𝑛": 260,
      "##а": 261,
      "##🏻": 262,
      "##​": 263,
      "##ℎ": 264,
      "##🇸": 265,
      "##𝑂": 266,
      "##er": 267,
      "##in": 268,
      "##at": 269,
      "th": 270,
      "##es": 271,
      "##or": 272,
      "##nt": 273,
      "##on": 274,
      "the": 275,
      "##st": 276,
      "##ed": 277,
      "##re": 278,
      "##le": 279,
      "##it": 280,
      "##nd": 281,
      "##ic": 282,
      "##al": 283,
      "##ing": 284,
      "##od": 285,
      "##ion": 286,
      "##ra": 287,
      "##me": 288,
      "st": 289,
      "to": 290,
      "##ct": 291,
      "##ar": 292,
      "##ou": 293,
      "of": 294,
      "re": 295,
      "in": 296,
      "##mp": 297,
      "##ode": 298,
      "##ac": 299,
      "ne": 300,
      "##as": 301,
      "##an": 302,
      "##ro": 303,
      "##ist": 304,
      "int": 305,
      "##en": 306,
      "##is": 307,
      "node": 308,
      "ar": 309,
      "##ue": 310,
      "co": 311,
      "is": 312,
      "##ut": 313,
      "##et": 314,
      "##ata": 315,
      "##ur": 316,
      "##ation": 317,
      "and": 318,
      "##ll": 319,
      "it": 320,
      "an": 321,
      "ad": 322,
      "data": 323,
      "##ray": 324,
      "for": 325,
      "##mple": 326,
      "##ment": 327,
      "wh": 328,
      "list": 329,
      "##ve": 330,
      "##ot": 331,
      "array": 332,
      "##em": 333,
      "##ly": 334,
      "str": 335,
      "##ce": 336,
      "##ig": 337,
      "ex": 338,
      "##uct": 339,
      "##ver": 340,
      "##ch": 341,
      "##ad": 342,
      "##ity": 343,
      "##ow": 344,
      "##ect": 345,
      "##ith": 346,
      "pr": 347,
      "##id": 348,
      "##se": 349,
      "new": 350,
      "##ass": 351,
      "##il": 352,
      "##int": 353,
      "##ex": 354,
      "or": 355,
      "cl": 356,
      "if": 357,
      "##ack": 358,
      "struct": 359,
      "pro": 360,
      "lin": 361,
      "po": 362,
      "be": 363,
      "##ub": 364,
      "##ure": 365,
      "class": 366,
      "##ir": 367,
      "##per": 368,
      "al": 369,
      "##xt": 370,
      "##ent": 371,
      "next": 372,
      "se": 373,
      "tre": 374,
      "on": 375,
      "ind": 376,
      "de": 377,
      "##est": 378,
      "##iz": 379,
      "##lic": 380,
      "add": 381,
      "we": 382,
      "so": 383,
      "##pe": 384,
      "he": 385,
      "##ge": 386,
      "##ort": 387,
      "out": 388,
      "con": 389,
      "link": 390,
      "##ime": 391,
      "##ble": 392,
      "##th": 393,
      "##ap": 394,
      "index": 395,
      "ch": 396,
      "##if": 397,
      "nu": 398,
      "stack": 399,
      "you": 400,
      "as": 401,
      "##ate": 402,
      "that": 403,
      "not": 404,
      "##ul": 405,
      "##ess": 406,
      "tree": 407,
      "linked": 408,
      "time": 409,
      "pub": 410,
      "public": 411,
      "##ach": 412,
      "are": 413,
      "us": 414,
      "##av": 415,
      "##am": 416,
      "can": 417,
      "##bj": 418,
      "##urn": 419,
      "##ert": 420,
      "##ithm": 421,
      "##ize": 422,
      "ret": 423,
      "##fer": 424,
      "##gor": 425,
      "##alue": 426,
      "##lement": 427,
      "return": 428,
      "algor": 429,
      "algorithm": 430,
      "structure": 431,
      "##ant": 432,
      "obj": 433,
      "comple": 434,
      "do": 435,
      "element": 436,
      "##ay": 437,
      "size": 438,
      "##iv": 439,
      "##ers": 440,
      "at": 441,
      "fro": 442,
      "##ore": 443,
      "##ere": 444,
      "##oo": 445,
      "##ations": 446,
      "this": 447,
      "##us": 448,
      "##ld": 449,
      "##arch": 450,
      "value": 451,
      "##atic": 452,
      "oper": 453,
      "jav": 454,
      "##igh": 455,
      "ty": 456,
      "##our": 457,
      "print": 458,
      "##ik": 459,
      "imple": 460,
      "some": 461,
      "que": 462,
      "##fs": 463,
      "pa": 464,
      "complex": 465,
      "from": 466,
      "head": 467,
      "##mo": 468,
      "##list": 469,
      "##ie": 470,
      "##ast": 471,
      "##ions": 472,
      "implement": 473,
      "tra": 474,
      "sy": 475,
      "adj": 476,
      "##un": 477,
      "what": 478,
      "iter": 479,
      "object": 480,
      "##ia": 481,
      "exp": 482,
      "le": 483,
      "get": 484,
      "java": 485,
      "##eth": 486,
      "##age": 487,
      "##im": 488,
      "null": 489,
      "with": 490,
      "##der": 491,
      "search": 492,
      "##pp": 493,
      "##yn": 494,
      "item": 495,
      "complexity": 496,
      "##ator": 497,
      "sh": 498,
      "pre": 499,
      "wor": 500,
      "##vers": 501,
      "ta": 502,
      "ma": 503,
      "##amic": 504,
      "dyn": 505,
      "##ive": 506,
      "dynamic": 507,
      "##ger": 508,
      "static": 509,
      "##oid": 510,
      "all": 511,
      "ins": 512,
      "##irst": 513,
      "##qu": 514,
      "gra": 515,
      "##ip": 516,
      "##ures": 517,
      "first": 518,
      "##mm": 519,
      "##put": 520,
      "##erf": 521,
      "remo": 522,
      "big": 523,
      "##stem": 524,
      "point": 525,
      "en": 526,
      "system": 527,
      "##ight": 528,
      "need": 529,
      "inte": 530,
      "exa": 531,
      "void": 532,
      "un": 533,
      "##ck": 534,
      "each": 535,
      "vis": 536,
      "##mb": 537,
      "##ial": 538,
      "comp": 539,
      "insert": 540,
      "##ph": 541,
      "##and": 542,
      "10": 543,
      "structures": 544,
      "refer": 545,
      "has": 546,
      "##gra": 547,
      "arraylist": 548,
      "##aly": 549,
      "use": 550,
      "how": 551,
      "analy": 552,
      "##ill": 553,
      "iterator": 554,
      "##pt": 555,
      "##ary": 556,
      "visit": 557,
      "integer": 558,
      "##odes": 559,
      "##apac": 560,
      "by": 561,
      "##ase": 562,
      "##apacity": 563,
      "##ty": 564,
      "queue": 565,
      "ro": 566,
      "##rent": 567,
      "##ence": 568,
      "##ace": 569,
      "##ild": 570,
      "set": 571,
      "nodes": 572,
      "##ine": 573,
      "##sis": 574,
      "cur": 575,
      "##all": 576,
      "res": 577,
      "arrays": 578,
      "qu": 579,
      "analysis": 580,
      "up": 581,
      "##art": 582,
      "top": 583,
      "##ous": 584,
      "##cc": 585,
      "inst": 586,
      "meth": 587,
      "progra": 588,
      "method": 589,
      "typ": 590,
      "##oc": 591,
      "remove": 592,
      "code": 593,
      "##ally": 594,
      "prev": 595,
      "order": 596,
      "##ory": 597,
      "ha": 598,
      "dou": 599,
      "su": 600,
      "operations": 601,
      "##data": 602,
      "no": 603,
      "##row": 604,
      "app": 605,
      "##ated": 606,
      "##ener": 607,
      "##orm": 608,
      "graph": 609,
      "##ance": 610,
      "example": 611,
      "##ies": 612,
      "mem": 613,
      "##ound": 614,
      "##ike": 615,
      "memory": 616,
      "elementdata": 617,
      "any": 618,
      "one": 619,
      "##cl": 620,
      "travers": 621,
      "##tt": 622,
      "work": 623,
      "ab": 624,
      "child": 625,
      "##ile": 626,
      "string": 627,
      "more": 628,
      "##mber": 629,
      "##ust": 630,
      "have": 631,
      "##ard": 632,
      "root": 633,
      "##capacity": 634,
      "implementation": 635,
      "##ter": 636,
      "##lo": 637,
      "like": 638,
      "bfs": 639,
      "##ath": 640,
      "visited": 641,
      "using": 642,
      "end": 643,
      "case": 644,
      "##out": 645,
      "##ction": 646,
      "##ep": 647,
      "##ition": 648,
      "##ould": 649,
      "##te": 650,
      "acc": 651,
      "traversal": 652,
      "##ln": 653,
      "sour": 654,
      "const": 655,
      "println": 656,
      "##cept": 657,
      "will": 658,
      "sp": 659,
      "##ics": 660,
      "arr": 661,
      "spe": 662,
      "last": 663,
      "##les": 664,
      "perf": 665,
      "dis": 666,
      "und": 667,
      "##iew": 668,
      "##ning": 669,
      "over": 670,
      "##node": 671,
      "##ff": 672,
      "gener": 673,
      "ed": 674,
      "##ab": 675,
      "sort": 676,
      "##ain": 677,
      "##ib": 678,
      "##ame": 679,
      "dif": 680,
      "##co": 681,
      "##enc": 682,
      "source": 683,
      "##ues": 684,
      "##ress": 685,
      "boo": 686,
      "var": 687,
      "used": 688,
      "##view": 689,
      "lists": 690,
      "mo": 691,
      "##able": 692,
      "cre": 693,
      "spec": 694,
      "number": 695,
      "types": 696,
      "##ther": 697,
      "##mpty": 698,
      "output": 699,
      "##ult": 700,
      "dfs": 701,
      "##ract": 702,
      "##inary": 703,
      "##ek": 704,
      "wik": 705,
      "##ner": 706,
      "##erm": 707,
      "algorithms": 708,
      "imp": 709,
      "##ich": 710,
      "pos": 711,
      "vert": 712,
      "where": 713,
      "type": 714,
      "call": 715,
      "items": 716,
      "binary": 717,
      "your": 718,
      "there": 719,
      "##ior": 720,
      "##ire": 721,
      "##ind": 722,
      "when": 723,
      "fun": 724,
      "def": 725,
      "access": 726,
      "other": 727,
      "des": 728,
      "##00": 729,
      "reference": 730,
      "##ating": 731,
      "perform": 732,
      "bound": 733,
      "my": 734,
      "##ges": 735,
      "##ious": 736,
      "##que": 737,
      "loo": 738,
      "appro": 739,
      "constant": 740,
      "operation": 741,
      "tr": 742,
      "which": 743,
      "##eck": 744,
      "##ke": 745,
      "newnode": 746,
      "differ": 747,
      "para": 748,
      "prior": 749,
      "te": 750,
      "##ical": 751,
      "htt": 752,
      "http": 753,
      "ass": 754,
      "giv": 755,
      "rep": 756,
      "##ient": 757,
      "##ud": 758,
      "input": 759,
      "##ings": 760,
      "##ush": 761,
      "cons": 762,
      "##pend": 763,
      "varia": 764,
      "given": 765,
      "only": 766,
      "cs": 767,
      "sing": 768,
      "pointer": 769,
      "##low": 770,
      "ke": 771,
      "review": 772,
      "tw": 773,
      "cont": 774,
      "trees": 775,
      "##ree": 776,
      "##lean": 777,
      "bas": 778,
      "##ount": 779,
      "specif": 780,
      "quest": 781,
      "##met": 782,
      "eff": 783,
      "heap": 784,
      "sub": 785,
      "go": 786,
      "boolean": 787,
      "##gh": 788,
      "##res": 789,
      "##oth": 790,
      "push": 791,
      "program": 792,
      "double": 793,
      "##um": 794,
      "fo": 795,
      "rec": 796,
      "curr": 797,
      "lo": 798,
      "##are": 799,
      "queues": 800,
      "##ft": 801,
      "##ular": 802,
      "el": 803,
      "pe": 804,
      "grow": 805,
      "same": 806,
      "me": 807,
      "##ong": 808,
      "comm": 809,
      "inner": 810,
      "space": 811,
      "then": 812,
      "notation": 813,
      "20": 814,
      "run": 815,
      "requ": 816,
      "current": 817,
      "##ates": 818,
      "min": 819,
      "parent": 820,
      "function": 821,
      "lect": 822,
      "mid": 823,
      "why": 824,
      "vs": 825,
      "##ice": 826,
      "##ected": 827,
      "##ested": 828,
      "programm": 829,
      "##ruct": 830,
      "##ite": 831,
      "##ices": 832,
      "part": 833,
      "create": 834,
      "##cr": 835,
      "priv": 836,
      "lecture": 837,
      "##ren": 838,
      "line": 839,
      "##con": 840,
      "private": 841,
      "stor": 842,
      "defin": 843,
      "two": 844,
      "##ark": 845,
      "##itive": 846,
      "store": 847,
      "tail": 848,
      "n2": 849,
      "##ign": 850,
      "import": 851,
      "under": 852,
      "##ick": 853,
      "##ough": 854,
      "man": 855,
      "but": 856,
      "##lle": 857,
      "##resent": 858,
      "im": 859,
      "##llow": 860,
      "##ese": 861,
      "questions": 862,
      "represent": 863,
      "##ext": 864,
      "cost": 865,
      "##ans": 866,
      "##irc": 867,
      "follow": 868,
      "effic": 869,
      "circ": 870,
      "##meters": 871,
      "si": 872,
      "about": 873,
      "parameters": 874,
      "##os": 875,
      "dele": 876,
      "##om": 877,
      "doub": 878,
      "##blem": 879,
      "loc": 880,
      "##erface": 881,
      "##ix": 882,
      "problem": 883,
      "sc": 884,
      "these": 885,
      "##op": 886,
      "vertices": 887,
      "am": 888,
      "let": 889,
      "org": 890,
      "ap": 891,
      "different": 892,
      "approach": 893,
      "##urs": 894,
      "does": 895,
      "equ": 896,
      "empty": 897,
      "n0": 898,
      "##ol": 899,
      "##ield": 900,
      "com": 901,
      "aver": 902,
      "##vel": 903,
      "dep": 904,
      "interface": 905,
      "##queue": 906,
      "##anc": 907,
      "id": 908,
      "##af": 909,
      "det": 910,
      "find": 911,
      "instance": 912,
      "pl": 913,
      "stacks": 914,
      "insertion": 915,
      "singly": 916,
      "circular": 917,
      "##ities": 918,
      "else": 919,
      "mod": 920,
      "##ide": 921,
      "right": 922,
      "should": 923,
      "file": 924,
      "##py": 925,
      "children": 926,
      "generics": 927,
      "priority": 928,
      "programming": 929,
      "image": 930,
      "doubly": 931,
      "average": 932,
      "iterators": 933,
      "##ception": 934,
      "term": 935,
      "##read": 936,
      "##gin": 937,
      "comput": 938,
      "##eight": 939,
      "equal": 940,
      "field": 941,
      "##ange": 942,
      "left": 943,
      "##ens": 944,
      "specific": 945,
      "old": 946,
      "##ang": 947,
      "classes": 948,
      "level": 949,
      "pop": 950,
      "##irect": 951,
      "worst": 952,
      "max": 953,
      "main": 954,
      "sol": 955,
      "arg": 956,
      "step": 957,
      "##order": 958,
      "start": 959,
      "see": 960,
      "make": 961,
      "##ks": 962,
      "would": 963,
      "##fore": 964,
      "common": 965,
      "way": 966,
      "##act": 967,
      "fix": 968,
      "##nected": 969,
      "export": 970,
      "want": 971,
      "rel": 972,
      "##very": 973,
      "log": 974,
      "##ater": 975,
      "##its": 976,
      "##ict": 977,
      "previous": 978,
      "its": 979,
      "while": 980,
      "low": 981,
      "##ject": 982,
      "tak": 983,
      "may": 984,
      "##10": 985,
      "##edia": 986,
      "##tra": 987,
      "##class": 988,
      "cour": 989,
      "##dle": 990,
      "##ish": 991,
      "loop": 992,
      "requir": 993,
      "position": 994,
      "##oday": 995,
      "outer": 996,
      "##bles": 997,
      "efficient": 998,
      "depth": 999,
      "##ipedia": 1000,
      "wiki": 1001,
      "wikipedia": 1002,
      "cast": 1003,
      "elements": 1004,
      "just": 1005,
      "path": 1006,
      "##ern": 1007,
      "##ency": 1008,
      "cor": 1009,
      "than": 1010,
      "init": 1011,
      "back": 1012,
      "##ail": 1013,
      "begin": 1014,
      "recurs": 1015,
      "middle": 1016,
      "mark": 1017,
      "paper": 1018,
      "remov": 1019,
      "works": 1020,
      "peek": 1021,
      "initial": 1022,
      "today": 1023,
      "##ments": 1024,
      "##inal": 1025,
      "seth": 1026,
      "adjac": 1027,
      "called": 1028,
      "mincapacity": 1029,
      "setheight": 1030,
      "check": 1031,
      "every": 1032,
      "temp": 1033,
      "##ink": 1034,
      "##we": 1035,
      "##thing": 1036,
      "instruct": 1037,
      "##eng": 1038,
      "bet": 1039,
      "gm": 1040,
      "sv": 1041,
      "##ized": 1042,
      "variable": 1043,
      "address": 1044,
      "upper": 1045,
      "post": 1046,
      "##bo": 1047,
      "nested": 1048,
      "things": 1049,
      "##array": 1050,
      "points": 1051,
      "following": 1052,
      "svg": 1053,
      "##so": 1054,
      "long": 1055,
      "inf": 1056,
      "true": 1057,
      "##one": 1058,
      "into": 1059,
      "er": 1060,
      "here": 1061,
      "descr": 1062,
      "##ces": 1063,
      "thr": 1064,
      "##ifi": 1065,
      "local": 1066,
      "both": 1067,
      "##ord": 1068,
      "methods": 1069,
      "##log": 1070,
      "important": 1071,
      "course": 1072,
      "##value": 1073,
      "##ually": 1074,
      "constants": 1075,
      "read": 1076,
      "append": 1077,
      "act": 1078,
      "hasn": 1079,
      "leng": 1080,
      "##uch": 1081,
      "length": 1082,
      "project": 1083,
      "##ason": 1084,
      "key": 1085,
      "##ry": 1086,
      "##io": 1087,
      "##ym": 1088,
      "stud": 1089,
      "concept": 1090,
      "et": 1091,
      "delet": 1092,
      "lg": 1093,
      "also": 1094,
      "through": 1095,
      "takes": 1096,
      "graphs": 1097,
      "kn": 1098,
      "ru": 1099,
      "war": 1100,
      "##ag": 1101,
      "##line": 1102,
      "hasnext": 1103,
      "##ead": 1104,
      "best": 1105,
      "##cre": 1106,
      "form": 1107,
      "pred": 1108,
      "##ose": 1109,
      "express": 1110,
      "##check": 1111,
      "sl": 1112,
      "val": 1113,
      "##ors": 1114,
      "applic": 1115,
      "##of": 1116,
      "short": 1117,
      "##ically": 1118,
      "colle": 1119,
      "describ": 1120,
      "ver": 1121,
      "ise": 1122,
      "adding": 1123,
      "needed": 1124,
      "running": 1125,
      "prim": 1126,
      "disc": 1127,
      "isempty": 1128,
      "##au": 1129,
      "##za": 1130,
      "err": 1131,
      "math": 1132,
      "##abil": 1133,
      "##way": 1134,
      "prov": 1135,
      "edu": 1136,
      "thro": 1137,
      "adv": 1138,
      "table": 1139,
      "bread": 1140,
      "##ases": 1141,
      "##ides": 1142,
      "args": 1143,
      "##ution": 1144,
      "##own": 1145,
      "pract": 1146,
      "##stand": 1147,
      "##ise": 1148,
      "expl": 1149,
      "good": 1150,
      "capacity": 1151,
      "##ttle": 1152,
      "etc": 1153,
      "variables": 1154,
      "throttle": 1155,
      "breadth": 1156,
      "newcapacity": 1157,
      "100": 1158,
      "gmu": 1159,
      "##cess": 1160,
      "##ful": 1161,
      "##ents": 1162,
      "grad": 1163,
      "mach": 1164,
      "##onym": 1165,
      "mult": 1166,
      "white": 1167,
      "copy": 1168,
      "##ider": 1169,
      "##uss": 1170,
      "##iple": 1171,
      "##onymous": 1172,
      "result": 1173,
      "##anced": 1174,
      "cs3": 1175,
      "before": 1176,
      "##iaz": 1177,
      "move": 1178,
      "lower": 1179,
      "upd": 1180,
      "af": 1181,
      "ev": 1182,
      "complete": 1183,
      "most": 1184,
      "machine": 1185,
      "piaz": 1186,
      "performance": 1187,
      "piazza": 1188,
      "##25": 1189,
      "##el": 1190,
      "##ak": 1191,
      "##ull": 1192,
      "##verse": 1193,
      "decl": 1194,
      "car": 1195,
      "deg": 1196,
      "##type": 1197,
      "abst": 1198,
      "quick": 1199,
      "know": 1200,
      "br": 1201,
      "##estine": 1202,
      "hash": 1203,
      "understand": 1204,
      "abstract": 1205,
      "##mples": 1206,
      "leaf": 1207,
      "amort": 1208,
      "##ween": 1209,
      "linear": 1210,
      "expression": 1211,
      "##mpl": 1212,
      "below": 1213,
      "without": 1214,
      "examples": 1215,
      "such": 1216,
      "vertex": 1217,
      "fields": 1218,
      "between": 1219,
      "primitive": 1220,
      "lar": 1221,
      "adt": 1222,
      "2025": 1223,
      "##rect": 1224,
      "sch": 1225,
      "ho": 1226,
      "partic": 1227,
      "ide": 1228,
      "ge": 1229,
      "##ared": 1230,
      "##app": 1231,
      "##board": 1232,
      "fact": 1233,
      "##ug": 1234,
      "predict": 1235,
      "cy": 1236,
      "##orial": 1237,
      "front": 1238,
      "after": 1239,
      "##ga": 1240,
      "warm": 1241,
      "discuss": 1242,
      "anonymous": 1243,
      "correct": 1244,
      "fr": 1245,
      "compil": 1246,
      "ht": 1247,
      "high": 1248,
      "convers": 1249,
      "alloc": 1250,
      "##ernal": 1251,
      "cs310": 1252,
      "keep": 1253,
      "simple": 1254,
      "bl": 1255,
      "##itt": 1256,
      "resour": 1257,
      "amortized": 1258,
      "much": 1259,
      "range": 1260,
      "collection": 1261,
      "2n": 1262,
      "##ify": 1263,
      "traverse": 1264,
      "edges": 1265,
      "terms": 1266,
      "equals": 1267,
      "casting": 1268,
      "very": 1269,
      "non": 1270,
      "ut": 1271,
      "enqueue": 1272,
      "cha": 1273,
      "count": 1274,
      "##lp": 1275,
      "##iss": 1276,
      "prob": 1277,
      "##cond": 1278,
      "must": 1279,
      "##ved": 1280,
      "put": 1281,
      "contain": 1282,
      "throw": 1283,
      "eas": 1284,
      "##usse": 1285,
      "##imit": 1286,
      "lang": 1287,
      "##ns": 1288,
      "extra": 1289,
      "##alk": 1290,
      "##ematic": 1291,
      "consider": 1292,
      "##olog": 1293,
      "##ian": 1294,
      "allow": 1295,
      "##ences": 1296,
      "later": 1297,
      "##ran": 1298,
      "proper": 1299,
      "mathematic": 1300,
      "ac": 1301,
      "per": 1302,
      "##ization": 1303,
      "height": 1304,
      "instead": 1305,
      "computer": 1306,
      "error": 1307,
      "iterable": 1308,
      "sw": 1309,
      "yes": 1310,
      "##pport": 1311,
      "t2": 1312,
      "##ages": 1313,
      "usually": 1314,
      "means": 1315,
      "adjacent": 1316,
      "deletion": 1317,
      "whiteboard": 1318,
      "resources": 1319,
      "##ual": 1320,
      "bad": 1321,
      "##uc": 1322,
      "down": 1323,
      "##ative": 1324,
      "tot": 1325,
      "##ector": 1326,
      "ens": 1327,
      "lot": 1328,
      "opt": 1329,
      "##atch": 1330,
      "##imes": 1331,
      "activ": 1332,
      "doc": 1333,
      "practice": 1334,
      "incre": 1335,
      "help": 1336,
      "cod": 1337,
      "##itions": 1338,
      "process": 1339,
      "lif": 1340,
      "##ta": 1341,
      "total": 1342,
      "ome": 1343,
      "##ri": 1344,
      "second": 1345,
      "summ": 1346,
      "basic": 1347,
      "storage": 1348,
      "detail": 1349,
      "util": 1350,
      "##ward": 1351,
      "modifi": 1352,
      "connected": 1353,
      "positive": 1354,
      "vector": 1355,
      "searching": 1356,
      "problems": 1357,
      "applications": 1358,
      "coding": 1359,
      "omega": 1360,
      "hu": 1361,
      "dequeue": 1362,
      "rangecheck": 1363,
      "hand": 1364,
      "web": 1365,
      "##ours": 1366,
      "bal": 1367,
      "wr": 1368,
      "##ling": 1369,
      "##ml": 1370,
      "bu": 1371,
      "pack": 1372,
      "fast": 1373,
      "neigh": 1374,
      "##exception": 1375,
      "neighb": 1376,
      "dur": 1377,
      "flo": 1378,
      "##rod": 1379,
      "lear": 1380,
      "those": 1381,
      "simpl": 1382,
      "limit": 1383,
      "##ne": 1384,
      "##side": 1385,
      "exe": 1386,
      "##fits": 1387,
      "##orge": 1388,
      "##member": 1389,
      "easy": 1390,
      "sem": 1391,
      "##ways": 1392,
      "remember": 1393,
      "##irected": 1394,
      "h1": 1395,
      "##tree": 1396,
      "##aps": 1397,
      "hours": 1398,
      "##cle": 1399,
      "##ctions": 1400,
      "implemented": 1401,
      "references": 1402,
      "byte": 1403,
      "sets": 1404,
      "basics": 1405,
      "exporter": 1406,
      "requires": 1407,
      "describes": 1408,
      "highest": 1409,
      "mathematical": 1410,
      "summary": 1411,
      "details": 1412,
      "##search": 1413,
      "mylist": 1414,
      "myclass": 1415,
      "##ester": 1416,
      "exception": 1417,
      "sep": 1418,
      "##ream": 1419,
      "off": 1420,
      "##ability": 1421,
      "##ivers": 1422,
      "inter": 1423,
      "implements": 1424,
      "generic": 1425,
      "final": 1426,
      "##xim": 1427,
      "particip": 1428,
      "introd": 1429,
      "returns": 1430,
      "expand": 1431,
      "shr": 1432,
      "approxim": 1433,
      "assign": 1434,
      "scen": 1435,
      "sched": 1436,
      "ary": 1437,
      "client": 1438,
      "note": 1439,
      "single": 1440,
      "required": 1441,
      "recursive": 1442,
      "##ntime": 1443,
      "##connected": 1444,
      "their": 1445,
      "rem": 1446,
      "edge": 1447,
      "multiple": 1448,
      "html": 1449,
      "float": 1450,
      "ban": 1451,
      "mat": 1452,
      "n3": 1453,
      "t1": 1454,
      "always": 1455,
      "outline": 1456,
      "uses": 1457,
      "typically": 1458,
      "sorted": 1459,
      "bounds": 1460,
      "definition": 1461,
      "removing": 1462,
      "concepts": 1463,
      "runtime": 1464,
      "updated": 1465,
      "ensure": 1466,
      "40": 1467,
      "##ves": 1468,
      "traversals": 1469,
      "binarysearch": 1470,
      "oldvalue": 1471,
      "##ness": 1472,
      "stored": 1473,
      "##man": 1474,
      "##ists": 1475,
      "fe": 1476,
      "##ional": 1477,
      "##lf": 1478,
      "##lying": 1479,
      "##ause": 1480,
      "charact": 1481,
      "##be": 1482,
      "##ants": 1483,
      "text": 1484,
      "well": 1485,
      "##other": 1486,
      "happ": 1487,
      "##ier": 1488,
      "uns": 1489,
      "univers": 1490,
      "emp": 1491,
      "nar": 1492,
      "##red": 1493,
      "num": 1494,
      "##ron": 1495,
      "##ars": 1496,
      "neighbor": 1497,
      "bo": 1498,
      "##iated": 1499,
      "underlying": 1500,
      "many": 1501,
      "delete": 1502,
      "recursion": 1503,
      "give": 1504,
      "sa": 1505,
      "##cend": 1506,
      "aslist": 1507,
      "##encil": 1508,
      "pencil": 1509,
      "something": 1510,
      "beginning": 1511,
      "scenar": 1512,
      "university": 1513,
      "##ied": 1514,
      "theta": 1515,
      "polle": 1516,
      "typical": 1517,
      "difference": 1518,
      "solution": 1519,
      "related": 1520,
      "loops": 1521,
      "docs": 1522,
      "package": 1523,
      "during": 1524,
      "11": 1525,
      "fl": 1526,
      "##dep": 1527,
      "##men": 1528,
      "char": 1529,
      "setdep": 1530,
      "special": 1531,
      "setdepth": 1532,
      "ag": 1533,
      "##bs": 1534,
      "##ware": 1535,
      "gr": 1536,
      "##hip": 1537,
      "##iter": 1538,
      "student": 1539,
      "occ": 1540,
      "repe": 1541,
      "orig": 1542,
      "##ands": 1543,
      "exec": 1544,
      "dem": 1545,
      "fal": 1546,
      "inde": 1547,
      "##wn": 1548,
      "##flow": 1549,
      "they": 1550,
      "week": 1551,
      "hal": 1552,
      "##iency": 1553,
      "sequ": 1554,
      "cond": 1555,
      "design": 1556,
      "aut": 1557,
      "##ins": 1558,
      "##ening": 1559,
      "pass": 1560,
      "##count": 1561,
      "##up": 1562,
      "state": 1563,
      "cal": 1564,
      "track": 1565,
      "compare": 1566,
      "look": 1567,
      "narrow": 1568,
      "stop": 1569,
      "reason": 1570,
      "##asure": 1571,
      "show": 1572,
      "perfect": 1573,
      "mason": 1574,
      "another": 1575,
      "av": 1576,
      "ph": 1577,
      "##pendent": 1578,
      "langu": 1579,
      "original": 1580,
      "george": 1581,
      "independent": 1582,
      "cases": 1583,
      "free": 1584,
      "##ana": 1585,
      "once": 1586,
      "addition": 1587,
      "disconnected": 1588,
      "sorting": 1589,
      "based": 1590,
      "grows": 1591,
      "definitions": 1592,
      "fixed": 1593,
      "values": 1594,
      "shortest": 1595,
      "grades": 1596,
      "modifiers": 1597,
      "webp": 1598,
      "semester": 1599,
      "approximation": 1600,
      "clients": 1601,
      "scenario": 1602,
      "sequence": 1603,
      "27": 1604,
      "30": 1605,
      "##nested": 1606,
      "##11": 1607,
      "adestine": 1608,
      "staticnested": 1609,
      "undirected": 1610,
      "oldcapacity": 1611,
      "##ting": 1612,
      "inv": 1613,
      "sur": 1614,
      "##not": 1615,
      "##uction": 1616,
      "##ird": 1617,
      "che": 1618,
      "integ": 1619,
      "false": 1620,
      "direct": 1621,
      "pres": 1622,
      "##ivid": 1623,
      "inform": 1624,
      "red": 1625,
      "##led": 1626,
      "##fic": 1627,
      "##rec": 1628,
      "character": 1629,
      "##ond": 1630,
      "##alu": 1631,
      "conc": 1632,
      "deb": 1633,
      "found": 1634,
      "mode": 1635,
      "##ring": 1636,
      "##boo": 1637,
      "functions": 1638,
      "try": 1639,
      "sim": 1640,
      "##wise": 1641,
      "##cles": 1642,
      "ent": 1643,
      "say": 1644,
      "##ule": 1645,
      "##rees": 1646,
      "##ash": 1647,
      "##lc": 1648,
      "them": 1649,
      "##ether": 1650,
      "support": 1651,
      "think": 1652,
      "real": 1653,
      "evalu": 1654,
      "reach": 1655,
      "op": 1656,
      "own": 1657,
      "##ux": 1658,
      "trans": 1659,
      "objects": 1660,
      "overflow": 1661,
      "otherwise": 1662,
      "##track": 1663,
      "advant": 1664,
      "##fg": 1665,
      "three": 1666,
      "arch": 1667,
      "poly": 1668,
      "explan": 1669,
      "shrink": 1670,
      "empir": 1671,
      "##ts": 1672,
      "somet": 1673,
      "useful": 1674,
      "##pends": 1675,
      "representation": 1676,
      "backtrack": 1677,
      "office": 1678,
      "information": 1679,
      "##port": 1680,
      "##wh": 1681,
      "added": 1682,
      "complexities": 1683,
      "##moved": 1684,
      "needs": 1685,
      "topics": 1686,
      "working": 1687,
      "https": 1688,
      "represents": 1689,
      "approaches": 1690,
      "efficiently": 1691,
      "hashing": 1692,
      "cycles": 1693,
      "compiler": 1694,
      "conversions": 1695,
      "balanced": 1696,
      "faster": 1697,
      "participation": 1698,
      "introduction": 1699,
      "language": 1700,
      "sometimes": 1701,
      "000": 1702,
      "12": 1703,
      "50": 1704,
      "59": 1705,
      "gu": 1706,
      "gfg": 1707,
      "sm": 1708,
      "##ving": 1709,
      "##internal": 1710,
      "##capacityinternal": 1711,
      "dfsrec": 1712,
      "adjacency": 1713,
      "ensurecapacityinternal": 1714,
      "nummoved": 1715,
      "pollev": 1716,
      "ra": 1717,
      "##come": 1718,
      "##und": 1719,
      "reco": 1720,
      "##tes": 1721,
      "##ank": 1722,
      "prot": 1723,
      "wid": 1724,
      "##less": 1725,
      "##ley": 1726,
      "##ensive": 1727,
      "##ss": 1728,
      "##gn": 1729,
      "##llab": 1730,
      "poss": 1731,
      "##copy": 1732,
      "tut": 1733,
      "##ilar": 1734,
      "ame": 1735,
      "##ging": 1736,
      "##rop": 1737,
      "fa": 1738,
      "##ible": 1739,
      "bec": 1740,
      "anytype": 1741,
      "determ": 1742,
      "ben": 1743,
      "##ok": 1744,
      "arraycopy": 1745,
      "##ully": 1746,
      "catch": 1747,
      "sk": 1748,
      "cover": 1749,
      "##ili": 1750,
      "name": 1751,
      "##ove": 1752,
      "take": 1753,
      "descend": 1754,
      "integers": 1755,
      "because": 1756,
      "mot": 1757,
      "##her": 1758,
      "##ople": 1759,
      "##nom": 1760,
      "##ze": 1761,
      "now": 1762,
      "##anges": 1763,
      "##istic": 1764,
      "##ific": 1765,
      "cannot": 1766,
      "##imum": 1767,
      "amount": 1768,
      "similar": 1769,
      "##where": 1770,
      "russe": 1771,
      "##cul": 1772,
      "third": 1773,
      "wel": 1774,
      "exact": 1775,
      "require": 1776,
      "model": 1777,
      "h2": 1778,
      "our": 1779,
      "##uted": 1780,
      "##thod": 1781,
      "subclass": 1782,
      "people": 1783,
      "steps": 1784,
      "slides": 1785,
      "large": 1786,
      "textboo": 1787,
      "debug": 1788,
      "polynom": 1789,
      "tutorial": 1790,
      "russell": 1791,
      "polynomial": 1792,
      "g2": 1793,
      "g1": 1794,
      "unt": 1795,
      "##de": 1796,
      "##inc": 1797,
      "##aves": 1798,
      "doing": 1799,
      "expensive": 1800,
      "ordered": 1801,
      "above": 1802,
      "therefore": 1803,
      "looks": 1804,
      "defined": 1805,
      "represented": 1806,
      "efficiency": 1807,
      "initialization": 1808,
      "instructions": 1809,
      "readings": 1810,
      "students": 1811,
      "provides": 1812,
      "advanced": 1813,
      "declared": 1814,
      "understanding": 1815,
      "idea": 1816,
      "activities": 1817,
      "learning": 1818,
      "schedule": 1819,
      "narrowing": 1820,
      "empirical": 1821,
      "widening": 1822,
      "200": 1823,
      "kr": 1824,
      "fits": 1825,
      "struc": 1826,
      "printarray": 1827,
      "1000": 1828,
      "prevnode": 1829,
      "inputarray": 1830,
      "instanceof": 1831,
      "modcount": 1832,
      "factorial": 1833,
      "lifo": 1834,
      "amethod": 1835,
      "##ms": 1836,
      "##ives": 1837,
      "##ustr": 1838,
      "##obj": 1839,
      "cr": 1840,
      "perm": 1841,
      "##graph": 1842,
      "super": 1843,
      "##aven": 1844,
      "##clud": 1845,
      "tas": 1846,
      "##len": 1847,
      "ca": 1848,
      "gre": 1849,
      "ill": 1850,
      "##ering": 1851,
      "##tend": 1852,
      "##ified": 1853,
      "welcome": 1854,
      "##ism": 1855,
      "ant": 1856,
      "cub": 1857,
      "##ons": 1858,
      "soft": 1859,
      "fill": 1860,
      "##cest": 1861,
      "##for": 1862,
      "##meter": 1863,
      "ans": 1864,
      "construct": 1865,
      "mar": 1866,
      "talk": 1867,
      "##ted": 1868,
      "##ining": 1869,
      "##ited": 1870,
      "stream": 1871,
      "assoc": 1872,
      "brit": 1873,
      "calcul": 1874,
      "oh": 1875,
      "##min": 1876,
      "quad": 1877,
      "foc": 1878,
      "hard": 1879,
      "litt": 1880,
      "expect": 1881,
      "due": 1882,
      "##pa": 1883,
      "assu": 1884,
      "##pl": 1885,
      "##als": 1886,
      "seek": 1887,
      "maint": 1888,
      "eng": 1889,
      "place": 1890,
      "raven": 1891,
      "##ah": 1892,
      "ancest": 1893,
      "aren": 1894,
      "factor": 1895,
      "half": 1896,
      "archange": 1897,
      "focus": 1898,
      "maintain": 1899,
      "310": 1900,
      "aux": 1901,
      "destine": 1902,
      "ora": 1903,
      "##icron": 1904,
      "internal": 1905,
      "beh": 1906,
      "##iend": 1907,
      "diffic": 1908,
      "book": 1909,
      "##ordered": 1910,
      "relations": 1911,
      "happen": 1912,
      "##iterator": 1913,
      "little": 1914,
      "jo": 1915,
      "test": 1916,
      "##vey": 1917,
      "syllab": 1918,
      "compon": 1919,
      "tech": 1920,
      "rule": 1921,
      "property": 1922,
      "repeated": 1923,
      "auxili": 1924,
      "difficult": 1925,
      "relationship": 1926,
      "maps": 1927,
      "##stack": 1928,
      "##ets": 1929,
      "outside": 1930,
      "preorder": 1931,
      "units": 1932,
      "compile": 1933,
      "compared": 1934,
      "anything": 1935,
      "creating": 1936,
      "bounded": 1937,
      "parameter": 1938,
      "specified": 1939,
      "heaps": 1940,
      "starting": 1941,
      "instruction": 1942,
      "describe": 1943,
      "degree": 1944,
      "conversion": 1945,
      "contains": 1946,
      "considered": 1947,
      "limitations": 1948,
      "banana": 1949,
      "explanation": 1950,
      "streams": 1951,
      "associated": 1952,
      "british": 1953,
      "oracle": 1954,
      "syllabus": 1955,
      "auxiliary": 1956,
      "15": 1957,
      "32": 1958,
      "##ison": 1959,
      "##ift": 1960,
      "javase": 1961,
      "sometype": 1962,
      "unordered": 1963,
      "method2": 1964,
      "##ards": 1965,
      "myiterator": 1966,
      "subtree": 1967,
      "##usselc": 1968,
      "krusselc": 1969,
      "om": 1970,
      "##king": 1971,
      "##ential": 1972,
      "far": 1973,
      "##aring": 1974,
      "##ience": 1975,
      "##pm": 1976,
      "##fully": 1977,
      "##gener": 1978,
      "ds": 1979,
      "fall": 1980,
      "la": 1981,
      "walk": 1982,
      "em": 1983,
      "mater": 1984,
      "##cious": 1985,
      "##ties": 1986,
      "clos": 1987,
      "numb": 1988,
      "write": 1989,
      "illustr": 1990,
      "fil": 1991,
      "vers": 1992,
      "##ee": 1993,
      "net": 1994,
      "##ational": 1995,
      "maybe": 1996,
      "##ined": 1997,
      "princ": 1998,
      "sever": 1999,
      "indic": 2000,
      "ple": 2001,
      "##acks": 2002,
      "dr": 2003,
      "drop": 2004,
      "ve": 2005,
      "##word": 2006,
      "##nto": 2007,
      "##adem": 2008,
      "self": 2009,
      "##cope": 2010,
      "vari": 2011,
      "content": 2012,
      "motiv": 2013,
      "##generic": 2014,
      "material": 2015,
      "full": 2016,
      "inher": 2017,
      "uncheck": 2018,
      "##eks": 2019,
      "assist": 2020,
      "degener": 2021,
      "academ": 2022,
      "optional": 2023,
      "demo": 2024,
      "unchecked": 2025,
      "bra": 2026,
      "hint": 2027,
      "question": 2028,
      "condition": 2029,
      "survey": 2030,
      "might": 2031,
      "sign": 2032,
      "##vis": 2033,
      "##oup": 2034,
      "##vent": 2035,
      "conver": 2036,
      "expans": 2037,
      "blank": 2038,
      "dist": 2039,
      "sib": 2040,
      "##ged": 2041,
      "##wor": 2042,
      "includ": 2043,
      "forward": 2044,
      "except": 2045,
      "##ading": 2046,
      "sin": 2047,
      "##cing": 2048,
      "##ection": 2049,
      "conscious": 2050,
      "inherit": 2051,
      "ci": 2052,
      "##ton": 2053,
      "##math": 2054,
      "isn": 2055,
      "lines": 2056,
      "along": 2057,
      "shift": 2058,
      "specify": 2059,
      "doesn": 2060,
      "probabil": 2061,
      "simplify": 2062,
      "cubic": 2063,
      "##iendly": 2064,
      "onto": 2065,
      "pers": 2066,
      "##ament": 2067,
      "##arithm": 2068,
      "been": 2069,
      "depends": 2070,
      "adds": 2071,
      "weiss": 2072,
      "links": 2073,
      "changes": 2074,
      "notations": 2075,
      "##ays": 2076,
      "prints": 2077,
      "leaves": 2078,
      "gets": 2079,
      "pointers": 2080,
      "enough": 2081,
      "analyze": 2082,
      "bytes": 2083,
      "overview": 2084,
      "created": 2085,
      "calls": 2086,
      "storing": 2087,
      "equality": 2088,
      "solve": 2089,
      "logarithm": 2090,
      "removed": 2091,
      "application": 2092,
      "copying": 2093,
      "larger": 2094,
      "allocate": 2095,
      "##ological": 2096,
      "allows": 2097,
      "properties": 2098,
      "activity": 2099,
      "assignment": 2100,
      "executed": 2101,
      "statements": 2102,
      "reasonable": 2103,
      "software": 2104,
      "assume": 2105,
      "components": 2106,
      "repeatedly": 2107,
      "principle": 2108,
      "several": 2109,
      "degenerate": 2110,
      "academic": 2111,
      "inheritance": 2112,
      "probabilistic": 2113,
      "03": 2114,
      "22": 2115,
      "3n": 2116,
      "37": 2117,
      "blo": 2118,
      "tation": 2119,
      "𝑛𝑛": 2120,
      "inorder": 2121,
      "##velo": 2122,
      "##ided": 2123,
      "javac": 2124,
      "printmath": 2125,
      "implemen": 2126,
      "mystack": 2127,
      "cs2": 2128,
      "postorder": 2129,
      "omicron": 2130,
      "printmathtree": 2131,
      "pick": 2132,
      "small": 2133,
      "dra": 2134,
      "ll": 2135,
      "sum": 2136,
      "##tern": 2137,
      "care": 2138,
      "##land": 2139,
      "##pect": 2140,
      "##erv": 2141,
      "stand": 2142,
      "wa": 2143,
      "att": 2144,
      "bre": 2145,
      "fund": 2146,
      "##edi": 2147,
      "impro": 2148,
      "command": 2149,
      "hunt": 2150,
      "bene": 2151,
      "ok": 2152,
      "supp": 2153,
      "sure": 2154,
      "##add": 2155,
      "##ipul": 2156,
      "##ibly": 2157,
      "ident": 2158,
      "cle": 2159,
      "synt": 2160,
      "subm": 2161,
      "obs": 2162,
      "##sh": 2163,
      "reg": 2164,
      "develo": 2165,
      "##most": 2166,
      "cf": 2167,
      "##ww": 2168,
      "##mpt": 2169,
      "exam": 2170,
      "numbers": 2171,
      "##work": 2172,
      "nat": 2173,
      "slow": 2174,
      "##element": 2175,
      "##oper": 2176,
      "##str": 2177,
      "##arly": 2178,
      "##ationexception": 2179,
      "##apt": 2180,
      "##uled": 2181,
      "overr": 2182,
      "general": 2183,
      "tell": 2184,
      "termin": 2185,
      "better": 2186,
      "group": 2187,
      "##lex": 2188,
      "individ": 2189,
      "manipul": 2190,
      "everything": 2191,
      "interview": 2192,
      "##vant": 2193,
      "##ber": 2194,
      "exist": 2195,
      "tag": 2196,
      "##inders": 2197,
      "define": 2198,
      "explain": 2199,
      "build": 2200,
      "individual": 2201,
      "could": 2202,
      "har": 2203,
      "##ood": 2204,
      "##ratic": 2205,
      "##ulation": 2206,
      "avoid": 2207,
      "fundament": 2208,
      "##ni": 2209,
      "##hes": 2210,
      "##gle": 2211,
      "enc": 2212,
      "unf": 2213,
      "via": 2214,
      "##name": 2215,
      "tog": 2216,
      "reus": 2217,
      "expon": 2218,
      "##imin": 2219,
      "programmer": 2220,
      "##after": 2221,
      "projects": 2222,
      "discussed": 2223,
      "please": 2224,
      "since": 2225,
      "bar": 2226,
      "hc": 2227,
      "hon": 2228,
      "hier": 2229,
      "turn": 2230,
      "times": 2231,
      "www": 2232,
      "##iting": 2233,
      "##ints": 2234,
      "assum": 2235,
      "##metic": 2236,
      "measure": 2237,
      "increment": 2238,
      "improve": 2239,
      "hierarch": 2240,
      "##ats": 2241,
      "comb": 2242,
      "socr": 2243,
      "underf": 2244,
      "backward": 2245,
      "keyword": 2246,
      "option": 2247,
      "huge": 2248,
      "exponential": 2249,
      "2h": 2250,
      "fre": 2251,
      "lacks": 2252,
      "##ven": 2253,
      "##ued": 2254,
      "ref": 2255,
      "arith": 2256,
      "treasure": 2257,
      "conn": 2258,
      "implementations": 2259,
      "tracing": 2260,
      "##pped": 2261,
      "making": 2262,
      "##cks": 2263,
      "refers": 2264,
      "upside": 2265,
      "anywhere": 2266,
      "priorities": 2267,
      "consists": 2268,
      "recap": 2269,
      "follows": 2270,
      "science": 2271,
      "api": 2272,
      "maximum": 2273,
      "ways": 2274,
      "initially": 2275,
      "results": 2276,
      "completely": 2277,
      "declare": 2278,
      "friendly": 2279,
      "allocating": 2280,
      "probing": 2281,
      "allowed": 2282,
      "swap": 2283,
      "lots": 2284,
      "increases": 2285,
      "helpful": 2286,
      "processing": 2287,
      "reminders": 2288,
      "occurs": 2289,
      "freeing": 2290,
      "reachable": 2291,
      "advantages": 2292,
      "raise": 2293,
      "possibly": 2294,
      "debugging": 2295,
      "until": 2296,
      "quadratic": 2297,
      "version": 2298,
      "assistance": 2299,
      "logarithmic": 2300,
      "carefully": 2301,
      "benefits": 2302,
      "together": 2303,
      "socrates": 2304,
