{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "NFD"
      },
      {
        "type": "StripAccents"
      },
      {
        "type": "Lowercase"
      }
    ]
  },
  "pre_tokenizer": {
    "type": "BertPreTokenizer"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      }
    ],
    "special_tokens": {
      "[CLS]": {
        "id": "[CLS]",
        "ids": [
          2
        ],
        "tokens": [
          "[CLS]"
        ]
      },
      "[SEP]": {
        "id": "[SEP]",
        "ids": [
          3
        ],
        "tokens": [
          "[SEP]"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "WordPiece",
    "unk_token": "[UNK]",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 100,
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "[MASK]": 4,
      "!": 5,
      "\"": 6,
      "#": 7,
      "$": 8,
      "%": 9,
      "&": 10,
      "'": 11,
      "(": 12,
      ")": 13,
      "*": 14,
      "+": 15,
      ",": 16,
      "-": 17,
      ".": 18,
      "/": 19,
      "0": 20,
      "1": 21,
      "2": 22,
      "3": 23,
      "4": 24,
      "5": 25,
      "6": 26,
      "7": 27,
      "8": 28,
      "9": 29,
      ":": 30,
      ";": 31,
      "<": 32,
      "=": 33,
      ">": 34,
      "?": 35,
      "@": 36,
      "[": 37,
      "\\": 38,
      "]": 39,
      "^": 40,
      "_": 41,
      "a": 42,
      "b": 43,
      "c": 44,
      "d": 45,
      "e": 46,
      "f": 47,
      "g": 48,
      "h": 49,
      "i": 50,
      "j": 51,
      "k": 52,
      "l": 53,
      "m": 54,
      "n": 55,
      "o": 56,
      "p": 57,
      "q": 58,
      "r": 59,
      "s": 60,
      "t": 61,
      "u": 62,
      "v": 63,
      "w": 64,
      "x": 65,
      "y": 66,
      "z": 67,
      "{": 68,
      "|": 69,
      "}": 70,
      "~": 71,
      "¦": 72,
      "©": 73,
      "®": 74,
      "°": 75,
      "·": 76,
      "º": 77,
      "ø": 78,
      "α": 79,
      "β": 80,
      "γ": 81,
      "δ": 82,
      "ε": 83,
      "θ": 84,
      "λ": 85,
      "μ": 86,
      "π": 87,
      "σ": 88,
      "φ": 89,
      "ω": 90,
      "а": 91,
      "в": 92,
      "и": 93,
      "н": 94,
      "с": 95,
      "෍": 96,
      "​": 97,
      "‍": 98,
      "–": 99,
      "—": 100,
      "’": 101,
      "“": 102,
      "”": 103,
      "•": 104,
      "…": 105,
      "ℎ": 106,
      "™": 107,
      "→": 108,
      "−": 109,
      "∴": 110,
      "≤": 111,
      "≥": 112,
      "⌈": 113,
      "⌉": 114,
      "⌊": 115,
      "⌋": 116,
      "─": 117,
      "═": 118,
      "▀": 119,
      "▄": 120,
      "█": 121,
      "░": 122,
      "▒": 123,
      "▓": 124,
      "■": 125,
      "□": 126,
      "▪": 127,
      "▬": 128,
      "▶": 129,
      "►": 130,
      "○": 131,
      "●": 132,
      "◕": 133,
      "★": 134,
      "☆": 135,
      "☒": 136,
      "☺": 137,
      "♂": 138,
      "♡": 139,
      "♥": 140,
      "♦": 141,
      "♪": 142,
      "♫": 143,
      "♬": 144,
      "✅": 145,
      "✓": 146,
      "✔": 147,
      "✨": 148,
      "❤": 149,
      "⠀": 150,
      "ツ": 151,
      "": 152,
      "": 153,
      "": 154,
      "𝑂": 155,
      "𝑘": 156,
      "𝑛": 157,
      "🇸": 158,
      "🇺": 159,
      "🍆": 160,
      "🎃": 161,
      "🎵": 162,
      "🎶": 163,
      "🏻": 164,
      "👀": 165,
      "👉": 166,
      "👌": 167,
      "👍": 168,
      "👏": 169,
      "💀": 170,
      "💕": 171,
      "💖": 172,
      "💜": 173,
      "💦": 174,
      "💩": 175,
      "💪": 176,
      "💯": 177,
      "💰": 178,
      "🔥": 179,
      "🗿": 180,
      "😀": 181,
      "😁": 182,
      "😂": 183,
      "😃": 184,
      "😄": 185,
      "😅": 186,
      "😆": 187,
      "😈": 188,
      "😉": 189,
      "😊": 190,
      "😋": 191,
      "😍": 192,
      "😎": 193,
      "😏": 194,
      "😐": 195,
      "😒": 196,
      "😔": 197,
      "😘": 198,
      "😛": 199,
      "😜": 200,
      "😞": 201,
      "😡": 202,
      "😢": 203,
      "😤": 204,
      "😩": 205,
      "😫": 206,
      "😬": 207,
      "😭": 208,
      "😱": 209,
      "😳": 210,
      "🙂": 211,
      "🙃": 212,
      "🙄": 213,
      "🙏": 214,
      "🚨": 215,
      "🤔": 216,
      "🤗": 217,
      "🤣": 218,
      "🤤": 219,
      "🤷": 220,
      "##y": 221,
      "##n": 222,
      "##c": 223,
      "##h": 224,
      "##r": 225,
      "##o": 226,
      "##t": 227,
      "##i": 228,
      "##l": 229,
      "##e": 230,
      "##d": 231,
      "##a": 232,
      "##s": 233,
      "##k": 234,
      "##g": 235,
      "##v": 236,
      "##x": 237,
      "##u": 238,
      "##m": 239,
      "##p": 240,
      "##b": 241,
      "##f": 242,
      "##5": 243,
      "##z": 244,
      "##w": 245,
      "##j": 246,
      "##q": 247,
      "##2": 248,
      "##1": 249,
      "##7": 250,
      "##0": 251,
      "##4": 252,
      "##6": 253,
      "##8": 254,
      "##3": 255,
      "##9": 256,
      "##ℎ": 257,
      "##𝑘": 258,
      "##​": 259,
      "##𝑛": 260,
      "##а": 261,
      "##🏻": 262,
      "##𝑂": 263,
      "##‍": 264,
      "##♂": 265,
      "##🇸": 266,
      "##er": 267,
      "##in": 268,
      "##at": 269,
      "th": 270,
      "##es": 271,
      "##or": 272,
      "##nt": 273,
      "##on": 274,
      "##st": 275,
      "the": 276,
      "##ed": 277,
      "##le": 278,
      "##re": 279,
      "##ic": 280,
      "##nd": 281,
      "##ing": 282,
      "##it": 283,
      "##al": 284,
      "##ion": 285,
      "##me": 286,
      "##od": 287,
      "##ra": 288,
      "st": 289,
      "##ct": 290,
      "to": 291,
      "##ou": 292,
      "##ar": 293,
      "re": 294,
      "of": 295,
      "##as": 296,
      "in": 297,
      "ne": 298,
      "##mp": 299,
      "##an": 300,
      "##ac": 301,
      "##ro": 302,
      "##ode": 303,
      "##en": 304,
      "int": 305,
      "ar": 306,
      "##ur": 307,
      "##ist": 308,
      "##et": 309,
      "##ue": 310,
      "co": 311,
      "##is": 312,
      "##ata": 313,
      "##ut": 314,
      "it": 315,
      "is": 316,
      "##ation": 317,
      "##ll": 318,
      "node": 319,
      "an": 320,
      "and": 321,
      "##ment": 322,
      "data": 323,
      "##em": 324,
      "for": 325,
      "##ray": 326,
      "wh": 327,
      "##ve": 328,
      "str": 329,
      "##mple": 330,
      "list": 331,
      "ad": 332,
      "array": 333,
      "##ot": 334,
      "##ce": 335,
      "##ass": 336,
      "##ly": 337,
      "cl": 338,
      "##ex": 339,
      "ex": 340,
      "new": 341,
      "##ect": 342,
      "##uct": 343,
      "pr": 344,
      "##ig": 345,
      "##ub": 346,
      "##id": 347,
      "##se": 348,
      "##ow": 349,
      "##ad": 350,
      "##ity": 351,
      "##ch": 352,
      "##ver": 353,
      "##lic": 354,
      "class": 355,
      "##il": 356,
      "##int": 357,
      "or": 358,
      "pro": 359,
      "##ith": 360,
      "if": 361,
      "ind": 362,
      "##ap": 363,
      "struct": 364,
      "##est": 365,
      "pub": 366,
      "public": 367,
      "##ure": 368,
      "so": 369,
      "##pe": 370,
      "be": 371,
      "##ack": 372,
      "po": 373,
      "se": 374,
      "index": 375,
      "##ge": 376,
      "lin": 377,
      "##ble": 378,
      "out": 379,
      "##iz": 380,
      "##ent": 381,
      "al": 382,
      "##xt": 383,
      "on": 384,
      "add": 385,
      "##per": 386,
      "de": 387,
      "next": 388,
      "we": 389,
      "he": 390,
      "##th": 391,
      "you": 392,
      "con": 393,
      "##ort": 394,
      "##urn": 395,
      "##ir": 396,
      "ret": 397,
      "tre": 398,
      "##bj": 399,
      "nu": 400,
      "return": 401,
      "ch": 402,
      "##av": 403,
      "##ess": 404,
      "##if": 405,
      "##ate": 406,
      "##ime": 407,
      "##am": 408,
      "obj": 409,
      "that": 410,
      "link": 411,
      "us": 412,
      "##ul": 413,
      "##lement": 414,
      "not": 415,
      "##ers": 416,
      "##alue": 417,
      "as": 418,
      "do": 419,
      "stack": 420,
      "can": 421,
      "element": 422,
      "##ach": 423,
      "are": 424,
      "##ize": 425,
      "time": 426,
      "##ay": 427,
      "##iv": 428,
      "##fer": 429,
      "##ant": 430,
      "this": 431,
      "linked": 432,
      "##oo": 433,
      "tree": 434,
      "##atic": 435,
      "##ld": 436,
      "structure": 437,
      "jav": 438,
      "sy": 439,
      "size": 440,
      "##ithm": 441,
      "at": 442,
      "##gor": 443,
      "value": 444,
      "some": 445,
      "iter": 446,
      "##us": 447,
      "##ore": 448,
      "algor": 449,
      "algorithm": 450,
      "print": 451,
      "object": 452,
      "oper": 453,
      "##ert": 454,
      "##ik": 455,
      "ty": 456,
      "imple": 457,
      "##mo": 458,
      "##ie": 459,
      "##ions": 460,
      "##ations": 461,
      "##ator": 462,
      "##igh": 463,
      "##ia": 464,
      "##eth": 465,
      "fro": 466,
      "que": 467,
      "what": 468,
      "comple": 469,
      "java": 470,
      "implement": 471,
      "##age": 472,
      "##ere": 473,
      "head": 474,
      "##our": 475,
      "item": 476,
      "##stem": 477,
      "system": 478,
      "static": 479,
      "##ast": 480,
      "##yn": 481,
      "##un": 482,
      "##arch": 483,
      "##pp": 484,
      "exp": 485,
      "ma": 486,
      "##im": 487,
      "null": 488,
      "get": 489,
      "##amic": 490,
      "dyn": 491,
      "##oid": 492,
      "dynamic": 493,
      "##der": 494,
      "with": 495,
      "wor": 496,
      "##qu": 497,
      "sh": 498,
      "le": 499,
      "##ive": 500,
      "from": 501,
      "ta": 502,
      "iterator": 503,
      "remo": 504,
      "##pt": 505,
      "##ures": 506,
      "##gra": 507,
      "##mm": 508,
      "void": 509,
      "need": 510,
      "un": 511,
      "##erf": 512,
      "pre": 513,
      "complex": 514,
      "##ight": 515,
      "en": 516,
      "ins": 517,
      "##apac": 518,
      "comp": 519,
      "##apacity": 520,
      "search": 521,
      "##mb": 522,
      "##and": 523,
      "structures": 524,
      "use": 525,
      "##eg": 526,
      "##ip": 527,
      "##ill": 528,
      "how": 529,
      "##list": 530,
      "tra": 531,
      "pa": 532,
      "##oc": 533,
      "has": 534,
      "arr": 535,
      "progra": 536,
      "##aly": 537,
      "meth": 538,
      "##ener": 539,
      "method": 540,
      "##ine": 541,
      "##vers": 542,
      "10": 543,
      "analy": 544,
      "integ": 545,
      "##ace": 546,
      "string": 547,
      "cur": 548,
      "insert": 549,
      "complexity": 550,
      "exa": 551,
      "all": 552,
      "##ty": 553,
      "##ase": 554,
      "set": 555,
      "refer": 556,
      "##rent": 557,
      "##cc": 558,
      "##sis": 559,
      "##ial": 560,
      "code": 561,
      "inst": 562,
      "qu": 563,
      "by": 564,
      "big": 565,
      "remove": 566,
      "##ence": 567,
      "analysis": 568,
      "##ous": 569,
      "each": 570,
      "queue": 571,
      "##all": 572,
      "point": 573,
      "##ln": 574,
      "##row": 575,
      "##irst": 576,
      "println": 577,
      "any": 578,
      "gra": 579,
      "##data": 580,
      "first": 581,
      "##put": 582,
      "##ck": 583,
      "su": 584,
      "##art": 585,
      "##ust": 586,
      "integer": 587,
      "##ance": 588,
      "typ": 589,
      "elementdata": 590,
      "up": 591,
      "##ally": 592,
      "arrays": 593,
      "ha": 594,
      "##tt": 595,
      "dou": 596,
      "res": 597,
      "##ild": 598,
      "##ory": 599,
      "no": 600,
      "order": 601,
      "##capacity": 602,
      "app": 603,
      "##fs": 604,
      "ab": 605,
      "##ile": 606,
      "##ks": 607,
      "##ary": 608,
      "##ies": 609,
      "using": 610,
      "operations": 611,
      "##cl": 612,
      "##cept": 613,
      "##ter": 614,
      "##ated": 615,
      "mem": 616,
      "##ound": 617,
      "##ike": 618,
      "##orm": 619,
      "##eneric": 620,
      "prev": 621,
      "##ph": 622,
      "##ard": 623,
      "ro": 624,
      "memory": 625,
      "##te": 626,
      "adj": 627,
      "example": 628,
      "have": 629,
      "##mber": 630,
      "##odes": 631,
      "acc": 632,
      "arraylist": 633,
      "more": 634,
      "will": 635,
      "##ould": 636,
      "##co": 637,
      "##ount": 638,
      "like": 639,
      "case": 640,
      "implementation": 641,
      "##ction": 642,
      "one": 643,
      "##ep": 644,
      "##iew": 645,
      "##ition": 646,
      "nodes": 647,
      "##node": 648,
      "##ame": 649,
      "my": 650,
      "end": 651,
      "##out": 652,
      "el": 653,
      "##ab": 654,
      "child": 655,
      "your": 656,
      "var": 657,
      "##view": 658,
      "over": 659,
      "##ath": 660,
      "##ues": 661,
      "const": 662,
      "boo": 663,
      "##able": 664,
      "##ress": 665,
      "##lo": 666,
      "dis": 667,
      "spe": 668,
      "sp": 669,
      "##ract": 670,
      "top": 671,
      "##les": 672,
      "##ult": 673,
      "##ner": 674,
      "wik": 675,
      "perf": 676,
      "lists": 677,
      "items": 678,
      "##ff": 679,
      "##ib": 680,
      "##ain": 681,
      "##ning": 682,
      "vis": 683,
      "##ther": 684,
      "##ior": 685,
      "type": 686,
      "access": 687,
      "para": 688,
      "und": 689,
      "program": 690,
      "root": 691,
      "operation": 692,
      "##enc": 693,
      "##pend": 694,
      "dif": 695,
      "spec": 696,
      "types": 697,
      "when": 698,
      "number": 699,
      "##ke": 700,
      "##ud": 701,
      "other": 702,
      "imp": 703,
      "newnode": 704,
      "sort": 705,
      "pos": 706,
      "travers": 707,
      "appro": 708,
      "##00": 709,
      "used": 710,
      "prior": 711,
      "sour": 712,
      "varia": 713,
      "htt": 714,
      "http": 715,
      "reference": 716,
      "cs": 717,
      "visit": 718,
      "def": 719,
      "##eck": 720,
      "loo": 721,
      "ed": 722,
      "graph": 723,
      "ass": 724,
      "current": 725,
      "double": 726,
      "tr": 727,
      "bound": 728,
      "des": 729,
      "generic": 730,
      "##ings": 731,
      "algorithms": 732,
      "##ich": 733,
      "fun": 734,
      "mo": 735,
      "call": 736,
      "##ious": 737,
      "review": 738,
      "last": 739,
      "work": 740,
      "##ating": 741,
      "##ind": 742,
      "go": 743,
      "##ical": 744,
      "quest": 745,
      "##ice": 746,
      "inner": 747,
      "source": 748,
      "constant": 749,
      "##lean": 750,
      "##ite": 751,
      "##ek": 752,
      "traversal": 753,
      "perform": 754,
      "##met": 755,
      "heap": 756,
      "##lle": 757,
      "there": 758,
      "same": 759,
      "##erm": 760,
      "where": 761,
      "queues": 762,
      "cre": 763,
      "boolean": 764,
      "stor": 765,
      "##mpty": 766,
      "##ext": 767,
      "##are": 768,
      "##ient": 769,
      "##que": 770,
      "only": 771,
      "arg": 772,
      "##ft": 773,
      "lect": 774,
      "te": 775,
      "which": 776,
      "priv": 777,
      "##ag": 778,
      "##um": 779,
      "programm": 780,
      "differ": 781,
      "min": 782,
      "##ong": 783,
      "cons": 784,
      "tw": 785,
      "private": 786,
      "bas": 787,
      "tail": 788,
      "##ested": 789,
      "but": 790,
      "com": 791,
      "rep": 792,
      "why": 793,
      "vs": 794,
      "rec": 795,
      "##erface": 796,
      "lecture": 797,
      "requ": 798,
      "pe": 799,
      "##gh": 800,
      "fo": 801,
      "##ush": 802,
      "curr": 803,
      "ap": 804,
      "##ang": 805,
      "cont": 806,
      "output": 807,
      "sub": 808,
      "##ign": 809,
      "trees": 810,
      "##ire": 811,
      "##ruct": 812,
      "comm": 813,
      "part": 814,
      "##eng": 815,
      "sing": 816,
      "##ception": 817,
      "specif": 818,
      "count": 819,
      "giv": 820,
      "ke": 821,
      "grow": 822,
      "##inary": 823,
      "questions": 824,
      "am": 825,
      "eff": 826,
      "im": 827,
      "cost": 828,
      "under": 829,
      "mid": 830,
      "##itive": 831,
      "me": 832,
      "binary": 833,
      "leng": 834,
      "run": 835,
      "store": 836,
      "length": 837,
      "loc": 838,
      "##cr": 839,
      "given": 840,
      "##py": 841,
      "##ree": 842,
      "equ": 843,
      "##ates": 844,
      "##meters": 845,
      "##op": 846,
      "push": 847,
      "interface": 848,
      "about": 849,
      "parameters": 850,
      "visited": 851,
      "##oth": 852,
      "does": 853,
      "space": 854,
      "two": 855,
      "##res": 856,
      "input": 857,
      "bfs": 858,
      "lo": 859,
      "##ese": 860,
      "##low": 861,
      "man": 862,
      "org": 863,
      "##ough": 864,
      "##ren": 865,
      "line": 866,
      "##ven": 867,
      "approach": 868,
      "si": 869,
      "##llow": 870,
      "old": 871,
      "import": 872,
      "defin": 873,
      "##ments": 874,
      "just": 875,
      "let": 876,
      "else": 877,
      "##os": 878,
      "instance": 879,
      "##ol": 880,
      "##blem": 881,
      "aver": 882,
      "follow": 883,
      "problem": 884,
      "these": 885,
      "n2": 886,
      "##ics": 887,
      "##ange": 888,
      "##ield": 889,
      "##ix": 890,
      "##ick": 891,
      "elements": 892,
      "##anc": 893,
      "function": 894,
      "##ide": 895,
      "sc": 896,
      "##urs": 897,
      "file": 898,
      "##ans": 899,
      "stacks": 900,
      "main": 901,
      "parent": 902,
      "id": 903,
      "priority": 904,
      "generics": 905,
      "programming": 906,
      "##10": 907,
      "iterators": 908,
      "##ities": 909,
      "should": 910,
      "make": 911,
      "mod": 912,
      "image": 913,
      "average": 914,
      "args": 915,
      "##cul": 916,
      "see": 917,
      "##bles": 918,
      "##om": 919,
      "##ject": 920,
      "pointer": 921,
      "20": 922,
      "n0": 923,
      "##ater": 924,
      "best": 925,
      "right": 926,
      "different": 927,
      "equal": 928,
      "##ected": 929,
      "effic": 930,
      "##resent": 931,
      "dele": 932,
      "##eight": 933,
      "##ens": 934,
      "disc": 935,
      "represent": 936,
      "##ict": 937,
      "export": 938,
      "##its": 939,
      "pl": 940,
      "##order": 941,
      "then": 942,
      "comput": 943,
      "classes": 944,
      "##type": 945,
      "create": 946,
      "##next": 947,
      "sol": 948,
      "field": 949,
      "left": 950,
      "append": 951,
      "want": 952,
      "rel": 953,
      "dfs": 954,
      "step": 955,
      "##thing": 956,
      "##queue": 957,
      "##edia": 958,
      "##very": 959,
      "##class": 960,
      "cour": 961,
      "er": 962,
      "would": 963,
      "##oday": 964,
      "stud": 965,
      "colle": 966,
      "outer": 967,
      "vert": 968,
      "max": 969,
      "##ipedia": 970,
      "wiki": 971,
      "wikipedia": 972,
      "variable": 973,
      "cast": 974,
      "hasnext": 975,
      "pap": 976,
      "##dle": 977,
      "det": 978,
      "cor": 979,
      "worst": 980,
      "##ark": 981,
      "fix": 982,
      "dep": 983,
      "##ized": 984,
      "paper": 985,
      "loop": 986,
      "today": 987,
      "seth": 988,
      "low": 989,
      "##af": 990,
      "mincapacity": 991,
      "setheight": 992,
      "middle": 993,
      "##ish": 994,
      "##kes": 995,
      "may": 996,
      "requir": 997,
      "previous": 998,
      "capacity": 999,
      "while": 1000,
      "notation": 1001,
      "instruct": 1002,
      "gm": 1003,
      "##inal": 1004,
      "sv": 1005,
      "works": 1006,
      "post": 1007,
      "student": 1008,
      "every": 1009,
      "nested": 1010,
      "##bo": 1011,
      "things": 1012,
      "##array": 1013,
      "methods": 1014,
      "svg": 1015,
      "##act": 1016,
      "##ail": 1017,
      "read": 1018,
      "##ern": 1019,
      "##ym": 1020,
      "specific": 1021,
      "children": 1022,
      "##ving": 1023,
      "##uch": 1024,
      "project": 1025,
      "recurs": 1026,
      "singly": 1027,
      "##ays": 1028,
      "long": 1029,
      "##ces": 1030,
      "throw": 1031,
      "##vel": 1032,
      "##ink": 1033,
      "result": 1034,
      "position": 1035,
      "##one": 1036,
      "##check": 1037,
      "bet": 1038,
      "course": 1039,
      "##value": 1040,
      "following": 1041,
      "cir": 1042,
      "##ond": 1043,
      "common": 1044,
      "##ifi": 1045,
      "local": 1046,
      "err": 1047,
      "car": 1048,
      "find": 1049,
      "than": 1050,
      "into": 1051,
      "address": 1052,
      "pop": 1053,
      "empty": 1054,
      "true": 1055,
      "##ually": 1056,
      "##ry": 1057,
      "act": 1058,
      "lg": 1059,
      "##ose": 1060,
      "peek": 1061,
      "start": 1062,
      "inf": 1063,
      "collection": 1064,
      "war": 1065,
      "##tra": 1066,
      "##ord": 1067,
      "bl": 1068,
      "##ved": 1069,
      "check": 1070,
      "sl": 1071,
      "##gin": 1072,
      "##we": 1073,
      "doub": 1074,
      "kn": 1075,
      "##onym": 1076,
      "log": 1077,
      "##io": 1078,
      "term": 1079,
      "##line": 1080,
      "##fore": 1081,
      "copy": 1082,
      "##read": 1083,
      "upper": 1084,
      "##onymous": 1085,
      "##of": 1086,
      "ver": 1087,
      "important": 1088,
      "##own": 1089,
      "adding": 1090,
      "constants": 1091,
      "##generic": 1092,
      "cs3": 1093,
      "good": 1094,
      "val": 1095,
      "##za": 1096,
      "##ices": 1097,
      "concept": 1098,
      "et": 1099,
      "level": 1100,
      "##ason": 1101,
      "init": 1102,
      "takes": 1103,
      "edu": 1104,
      "efficient": 1105,
      "its": 1106,
      "thro": 1107,
      "##uss": 1108,
      "##ency": 1109,
      "##abil": 1110,
      "pract": 1111,
      "initial": 1112,
      "##ttle": 1113,
      "depth": 1114,
      "variables": 1115,
      "doubly": 1116,
      "throttle": 1117,
      "newcapacity": 1118,
      "##cular": 1119,
      "gmu": 1120,
      "descr": 1121,
      "thr": 1122,
      "grad": 1123,
      "mach": 1124,
      "math": 1125,
      "##ution": 1126,
      "white": 1127,
      "##so": 1128,
      "##au": 1129,
      "needed": 1130,
      "insertion": 1131,
      "points": 1132,
      "circular": 1133,
      "prim": 1134,
      "100": 1135,
      "##el": 1136,
      "back": 1137,
      "begin": 1138,
      "##even": 1139,
      "##ors": 1140,
      "##ful": 1141,
      "##iaz": 1142,
      "##ically": 1143,
      "##estine": 1144,
      "anonymous": 1145,
      "pred": 1146,
      "machine": 1147,
      "piaz": 1148,
      "amort": 1149,
      "piazza": 1150,
      "##exception": 1151,
      "express": 1152,
      "counteven": 1153,
      "cs310": 1154,
      "##anced": 1155,
      "##ise": 1156,
      "##unt": 1157,
      "##cre": 1158,
      "through": 1159,
      "form": 1160,
      "etc": 1161,
      "called": 1162,
      "abst": 1163,
      "way": 1164,
      "hash": 1165,
      "discuss": 1166,
      "##ides": 1167,
      "abstract": 1168,
      "wr": 1169,
      "##stand": 1170,
      "key": 1171,
      "##ead": 1172,
      "also": 1173,
      "graphs": 1174,
      "performance": 1175,
      "adt": 1176,
      "anytype": 1177,
      "amortized": 1178,
      "here": 1179,
      "##rect": 1180,
      "know": 1181,
      "temp": 1182,
      "br": 1183,
      "##nected": 1184,
      "ge": 1185,
      "describ": 1186,
      "af": 1187,
      "##ctions": 1188,
      "##pport": 1189,
      "##board": 1190,
      "ise": 1191,
      "fields": 1192,
      "high": 1193,
      "lar": 1194,
      "adv": 1195,
      "warm": 1196,
      "isempty": 1197,
      "##cess": 1198,
      "correct": 1199,
      "compil": 1200,
      "##ak": 1201,
      "convers": 1202,
      "table": 1203,
      "partic": 1204,
      "##ases": 1205,
      "##log": 1206,
      "lower": 1207,
      "##itt": 1208,
      "exception": 1209,
      "later": 1210,
      "resour": 1211,
      "much": 1212,
      "range": 1213,
      "decl": 1214,
      "##mpl": 1215,
      "front": 1216,
      "elt": 1217,
      "equals": 1218,
      "vertices": 1219,
      "casting": 1220,
      "error": 1221,
      "very": 1222,
      "primitive": 1223,
      "iterable": 1224,
      "ut": 1225,
      "quick": 1226,
      "##ull": 1227,
      "##iss": 1228,
      "prob": 1229,
      "ide": 1230,
      "bad": 1231,
      "cha": 1232,
      "down": 1233,
      "ho": 1234,
      "put": 1235,
      "##ug": 1236,
      "##ider": 1237,
      "before": 1238,
      "complete": 1239,
      "predict": 1240,
      "expression": 1241,
      "stored": 1242,
      "##usse": 1243,
      "opt": 1244,
      "sch": 1245,
      "both": 1246,
      "fr": 1247,
      "path": 1248,
      "##ian": 1249,
      "understand": 1250,
      "##ernal": 1251,
      "##ared": 1252,
      "short": 1253,
      "##ative": 1254,
      "##app": 1255,
      "simple": 1256,
      "##ify": 1257,
      "implements": 1258,
      "storage": 1259,
      "running": 1260,
      "whiteboard": 1261,
      "after": 1262,
      "resources": 1263,
      "lang": 1264,
      "extra": 1265,
      "eas": 1266,
      "##uc": 1267,
      "applic": 1268,
      "mark": 1269,
      "##ges": 1270,
      "activ": 1271,
      "yes": 1272,
      "t2": 1273,
      "usually": 1274,
      "without": 1275,
      "practice": 1276,
      "##ule": 1277,
      "##ual": 1278,
      "expl": 1279,
      "##imit": 1280,
      "##ns": 1281,
      "##edo": 1282,
      "cod": 1283,
      "##alk": 1284,
      "##ematic": 1285,
      "ht": 1286,
      "tot": 1287,
      "alloc": 1288,
      "##ran": 1289,
      "delet": 1290,
      "mathematic": 1291,
      "lot": 1292,
      "mult": 1293,
      "per": 1294,
      "##atch": 1295,
      "##ization": 1296,
      "summ": 1297,
      "ac": 1298,
      "##imes": 1299,
      "modifi": 1300,
      "##ween": 1301,
      "most": 1302,
      "##irect": 1303,
      "util": 1304,
      "2n": 1305,
      "those": 1306,
      "such": 1307,
      "between": 1308,
      "coding": 1309,
      "##ga": 1310,
      "doc": 1311,
      "uns": 1312,
      "rangecheck": 1313,
      "non": 1314,
      "prov": 1315,
      "##itions": 1316,
      "##ours": 1317,
      "##lp": 1318,
      "total": 1319,
      "##ri": 1320,
      "hand": 1321,
      "sw": 1322,
      "keep": 1323,
      "computer": 1324,
      "addition": 1325,
      "positive": 1326,
      "must": 1327,
      "##ves": 1328,
      "problems": 1329,
      "##iple": 1330,
      "##oduct": 1331,
      "lear": 1332,
      "bal": 1333,
      "##ences": 1334,
      "##fits": 1335,
      "##orge": 1336,
      "##member": 1337,
      "proper": 1338,
      "ev": 1339,
      "sem": 1340,
      "##side": 1341,
      "off": 1342,
      "height": 1343,
      "pack": 1344,
      "##cle": 1345,
      "remember": 1346,
      "fast": 1347,
      "fact": 1348,
      "h1": 1349,
      "##aps": 1350,
      "easy": 1351,
      "cy": 1352,
      "hours": 1353,
      "sets": 1354,
      "instead": 1355,
      "basics": 1356,
      "exporter": 1357,
      "terms": 1358,
      "summary": 1359,
      "##ins": 1360,
      "enqueue": 1361,
      "mylist": 1362,
      "myclass": 1363,
      "##ne": 1364,
      "process": 1365,
      "##ester": 1366,
      "flo": 1367,
      "##cond": 1368,
      "##ream": 1369,
      "exe": 1370,
      "ens": 1371,
      "##ling": 1372,
      "##be": 1373,
      "detail": 1374,
      "option": 1375,
      "fal": 1376,
      "op": 1377,
      "##lying": 1378,
      "##ta": 1379,
      "byte": 1380,
      "basic": 1381,
      "requires": 1382,
      "##ivers": 1383,
      "##25": 1384,
      "dequeue": 1385,
      "inter": 1386,
      "help": 1387,
      "sm": 1388,
      "##xim": 1389,
      "consider": 1390,
      "particip": 1391,
      "allow": 1392,
      "##come": 1393,
      "contain": 1394,
      "simpl": 1395,
      "limit": 1396,
      "ome": 1397,
      "approxim": 1398,
      "assign": 1399,
      "move": 1400,
      "##mples": 1401,
      "client": 1402,
      "##lf": 1403,
      "##bs": 1404,
      "##ages": 1405,
      "##ability": 1406,
      "rem": 1407,
      "bu": 1408,
      "##orial": 1409,
      "below": 1410,
      "outline": 1411,
      "examples": 1412,
      "adjac": 1413,
      "underlying": 1414,
      "delete": 1415,
      "recursion": 1416,
      "concepts": 1417,
      "mathematical": 1418,
      "omega": 1419,
      "oldvalue": 1420,
      "incre": 1421,
      "##ness": 1422,
      "gener": 1423,
      "bread": 1424,
      "expand": 1425,
      "charact": 1426,
      "##ways": 1427,
      "##iter": 1428,
      "ary": 1429,
      "leaf": 1430,
      "false": 1431,
      "##ants": 1432,
      "text": 1433,
      "float": 1434,
      "dur": 1435,
      "t1": 1436,
      "deg": 1437,
      "wel": 1438,
      "removing": 1439,
      "references": 1440,
      "highest": 1441,
      "details": 1442,
      "breadth": 1443,
      "ban": 1444,
      "2025": 1445,
      "final": 1446,
      "occ": 1447,
      "univers": 1448,
      "emp": 1449,
      "nar": 1450,
      "lif": 1451,
      "##ron": 1452,
      "##other": 1453,
      "##man": 1454,
      "second": 1455,
      "##verse": 1456,
      "fl": 1457,
      "##ml": 1458,
      "##copy": 1459,
      "single": 1460,
      "give": 1461,
      "intr": 1462,
      "show": 1463,
      "##encil": 1464,
      "pencil": 1465,
      "something": 1466,
      "university": 1467,
      "##red": 1468,
      "##vert": 1469,
      "polle": 1470,
      "typical": 1471,
      "bounds": 1472,
      "functions": 1473,
      "many": 1474,
      "solution": 1475,
      "related": 1476,
      "required": 1477,
      "docs": 1478,
      "package": 1479,
      "ensure": 1480,
      "welcome": 1481,
      "##dep": 1482,
      "##men": 1483,
      "arraycopy": 1484,
      "setdep": 1485,
      "special": 1486,
      "counteven2": 1487,
      "setdepth": 1488,
      "##ware": 1489,
      "##ars": 1490,
      "gr": 1491,
      "fe": 1492,
      "##olog": 1493,
      "##not": 1494,
      "##ger": 1495,
      "orig": 1496,
      "scen": 1497,
      "sched": 1498,
      "ag": 1499,
      "##iated": 1500,
      "inde": 1501,
      "upd": 1502,
      "bo": 1503,
      "##ward": 1504,
      "##tree": 1505,
      "connected": 1506,
      "linear": 1507,
      "dem": 1508,
      "always": 1509,
      "compare": 1510,
      "typically": 1511,
      "means": 1512,
      "loops": 1513,
      "describes": 1514,
      "hal": 1515,
      "char": 1516,
      "design": 1517,
      "traversals": 1518,
      "##ause": 1519,
      "pass": 1520,
      "state": 1521,
      "num": 1522,
      "cal": 1523,
      "##hip": 1524,
      "chang": 1525,
      "narrow": 1526,
      "aut": 1527,
      "stop": 1528,
      "perfect": 1529,
      "##pendent": 1530,
      "mason": 1531,
      "##ds": 1532,
      "##ening": 1533,
      "exec": 1534,
      "ph": 1535,
      "##tend": 1536,
      "original": 1537,
      "independent": 1538,
      "sa": 1539,
      "another": 1540,
      "george": 1541,
      "html": 1542,
      "reco": 1543,
      "returns": 1544,
      "uses": 1545,
      "objects": 1546,
      "searching": 1547,
      "traverse": 1548,
      "integers": 1549,
      "definitions": 1550,
      "grades": 1551,
      "write": 1552,
      "modifiers": 1553,
      "semester": 1554,
      "approximation": 1555,
      "clients": 1556,
      "11": 1557,
      "##nested": 1558,
      "##11": 1559,
      "arch": 1560,
      "itr": 1561,
      "adestine": 1562,
      "sequ": 1563,
      "cond": 1564,
      "staticnested": 1565,
      "shr": 1566,
      "oldcapacity": 1567,
      "happ": 1568,
      "##ier": 1569,
      "inv": 1570,
      "##ana": 1571,
      "sur": 1572,
      "##count": 1573,
      "che": 1574,
      "##pl": 1575,
      "##asure": 1576,
      "##ting": 1577,
      "##ivid": 1578,
      "##fic": 1579,
      "note": 1580,
      "character": 1581,
      "##wn": 1582,
      "##alu": 1583,
      "##cend": 1584,
      "conc": 1585,
      "langu": 1586,
      "scenar": 1587,
      "cases": 1588,
      "free": 1589,
      "runt": 1590,
      "##ied": 1591,
      "implemented": 1592,
      "recursive": 1593,
      "applications": 1594,
      "sequence": 1595,
      "runtime": 1596,
      "##ring": 1597,
      "##iency": 1598,
      "##boo": 1599,
      "well": 1600,
      "ds": 1601,
      "repe": 1602,
      "##ash": 1603,
      "##lc": 1604,
      "##up": 1605,
      "them": 1606,
      "week": 1607,
      "look": 1608,
      "small": 1609,
      "gu": 1610,
      "think": 1611,
      "sep": 1612,
      "convert": 1613,
      "evalu": 1614,
      "##ands": 1615,
      "name": 1616,
      "numb": 1617,
      "##flow": 1618,
      "empir": 1619,
      "deb": 1620,
      "somet": 1621,
      "##pends": 1622,
      "multiple": 1623,
      "office": 1624,
      "av": 1625,
      "mat": 1626,
      "mode": 1627,
      "##wh": 1628,
      "theta": 1629,
      "cannot": 1630,
      "##moved": 1631,
      "needs": 1632,
      "topics": 1633,
      "https": 1634,
      "approaches": 1635,
      "definition": 1636,
      "values": 1637,
      "hashing": 1638,
      "compiler": 1639,
      "conversions": 1640,
      "deletion": 1641,
      "participation": 1642,
      "during": 1643,
      "language": 1644,
      "scenario": 1645,
      "sometimes": 1646,
      "000": 1647,
      "12": 1648,
      "27": 1649,
      "##led": 1650,
      "##internal": 1651,
      "##capacityinternal": 1652,
      "bestgeneric": 1653,
      "pollev": 1654,
      "ensurecapacityinternal": 1655,
      "nummoved": 1656,
      "ra": 1657,
      "they": 1658,
      "sum": 1659,
      "##tes": 1660,
      "##ank": 1661,
      "wid": 1662,
      "##ara": 1663,
      "##ley": 1664,
      "##ensive": 1665,
      "inform": 1666,
      "##less": 1667,
      "##llab": 1668,
      "##rop": 1669,
      "their": 1670,
      "ref": 1671,
      "ame": 1672,
      "##ging": 1673,
      "##ock": 1674,
      "sorted": 1675,
      "edges": 1676,
      "vertex": 1677,
      "efficiently": 1678,
      "balanced": 1679,
      "faster": 1680,
      "50": 1681,
      "59": 1682,
      "ben": 1683,
      "##ts": 1684,
      "##ents": 1685,
      "ent": 1686,
      "sk": 1687,
      "##ists": 1688,
      "fa": 1689,
      "say": 1690,
      "track": 1691,
      "support": 1692,
      "mot": 1693,
      "##her": 1694,
      "##wise": 1695,
      "##ons": 1696,
      "real": 1697,
      "reason": 1698,
      "cover": 1699,
      "prot": 1700,
      "##ople": 1701,
      "hu": 1702,
      "own": 1703,
      "##ss": 1704,
      "##istic": 1705,
      "trans": 1706,
      "amount": 1707,
      "##where": 1708,
      "russe": 1709,
      "##thod": 1710,
      "h2": 1711,
      "our": 1712,
      "people": 1713,
      "subclass": 1714,
      "slides": 1715,
      "large": 1716,
      "textboo": 1717,
      "information": 1718,
      "russell": 1719,
      "found": 1720,
      "g2": 1721,
      "g1": 1722,
      "##aves": 1723,
      "doing": 1724,
      "expensive": 1725,
      "uncheck": 1726,
      "complexities": 1727,
      "ordered": 1728,
      "otherwise": 1729,
      "sorting": 1730,
      "looks": 1731,
      "difference": 1732,
      "based": 1733,
      "fixed": 1734,
      "instructions": 1735,
      "students": 1736,
      "readings": 1737,
      "advanced": 1738,
      "declared": 1739,
      "activities": 1740,
      "learning": 1741,
      "optional": 1742,
      "schedule": 1743,
      "narrowing": 1744,
      "archange": 1745,
      "numbers": 1746,
      "empirical": 1747,
      "widening": 1748,
      "unchecked": 1749,
      "200": 1750,
      "310": 1751,
      "destine": 1752,
      "kr": 1753,
      "fits": 1754,
      "##ationexception": 1755,
      "struc": 1756,
      "printarray": 1757,
      "prevnode": 1758,
      "inputarray": 1759,
      "instanceof": 1760,
      "modcount": 1761,
      "##iterator": 1762,
      "amethod": 1763,
      "test": 1764,
      "##ism": 1765,
      "##ives": 1766,
      "##cles": 1767,
      "##ully": 1768,
      "cr": 1769,
      "catch": 1770,
      "try": 1771,
      "even": 1772,
      "##ok": 1773,
      "##ustr": 1774,
      "##bor": 1775,
      "##ector": 1776,
      "pres": 1777,
      "##aven": 1778,
      "now": 1779,
      "sure": 1780,
      "turn": 1781,
      "##len": 1782,
      "bec": 1783,
      "web": 1784,
      "##ific": 1785,
      "overflow": 1786,
      "poss": 1787,
      "require": 1788,
      "shrink": 1789,
      "model": 1790,
      "gre": 1791,
      "mar": 1792,
      "##for": 1793,
      "##uted": 1794,
      "useful": 1795,
      "maybe": 1796,
      "debug": 1797,
      "ant": 1798,
      "n3": 1799,
      "##ms": 1800,
      "soft": 1801,
      "working": 1802,
      "initialization": 1803,
      "idea": 1804,
      "cycles": 1805,
      "adjacent": 1806,
      "because": 1807,
      "30": 1808,
      "40": 1809,
      "ill": 1810,
      "##ible": 1811,
      "##element": 1812,
      "##meter": 1813,
      "1000": 1814,
      "determ": 1815,
      "sim": 1816,
      "##ee": 1817,
      "##ax": 1818,
      "##port": 1819,
      "stream": 1820,
      "brit": 1821,
      "calcul": 1822,
      "oh": 1823,
      "##eks": 1824,
      "##und": 1825,
      "supp": 1826,
      "foc": 1827,
      "hard": 1828,
      "litt": 1829,
      "##ering": 1830,
      "##als": 1831,
      "expect": 1832,
      "take": 1833,
      "super": 1834,
      "##ift": 1835,
      "##ular": 1836,
      "eng": 1837,
      "assu": 1838,
      "place": 1839,
      "unsu": 1840,
      "raven": 1841,
      "seek": 1842,
      "aren": 1843,
      "##oduction": 1844,
      "demo": 1845,
      "half": 1846,
      "focus": 1847,
      "ora": 1848,
      "##ze": 1849,
      "three": 1850,
      "##icron": 1851,
      "book": 1852,
      "diffic": 1853,
      "##ordered": 1854,
      "better": 1855,
      "##ified": 1856,
      "little": 1857,
      "tut": 1858,
      "neigh": 1859,
      "##vey": 1860,
      "syllab": 1861,
      "edge": 1862,
      "tech": 1863,
      "instruction": 1864,
      "everything": 1865,
      "beginning": 1866,
      "property": 1867,
      "difficult": 1868,
      "maps": 1869,
      "vector": 1870,
      "##ading": 1871,
      "outside": 1872,
      "##bject": 1873,
      "units": 1874,
      "compile": 1875,
      "anything": 1876,
      "parameter": 1877,
      "bounded": 1878,
      "heaps": 1879,
      "comments": 1880,
      "grows": 1881,
      "efficiency": 1882,
      "conversion": 1883,
      "understanding": 1884,
      "limitations": 1885,
      "banana": 1886,
      "introduction": 1887,
      "streams": 1888,
      "british": 1889,
      "unsupport": 1890,
      "oracle": 1891,
      "syllabus": 1892,
      "fill": 1893,
      "jo": 1894,
      "om": 1895,
      "beh": 1896,
      "##perationexception": 1897,
      "javase": 1898,
      "sometype": 1899,
      "unordered": 1900,
      "method2": 1901,
      "##ards": 1902,
      "mygeneric": 1903,
      "myds": 1904,
      "myiterator": 1905,
      "##usselc": 1906,
      "##edoperationexception": 1907,
      "krusselc": 1908,
      "unsupportedoperationexception": 1909,
      "talk": 1910,
      "assoc": 1911,
      "em": 1912,
      "##ether": 1913,
      "descend": 1914,
      "##pm": 1915,
      "direct": 1916,
      "##ah": 1917,
      "maint": 1918,
      "fall": 1919,
      "##gn": 1920,
      "##imum": 1921,
      "factor": 1922,
      "maintain": 1923,
      "fil": 1924,
      "mater": 1925,
      "##cious": 1926,
      "##mpt": 1927,
      "relations": 1928,
      "red": 1929,
      "tas": 1930,
      "unt": 1931,
      "vers": 1932,
      "##ational": 1933,
      "##ilar": 1934,
      "command": 1935,
      "steps": 1936,
      "repeated": 1937,
      "tutorial": 1938,
      "relationship": 1939,
      "##ining": 1940,
      "once": 1941,
      "##ird": 1942,
      "preorder": 1943,
      "define": 1944,
      "represents": 1945,
      "associated": 1946,
      "15": 1947,
      "32": 1948,
      "la": 1949,
      "##ale": 1950,
      "##search": 1951,
      "aslist": 1952,
      "construct": 1953,
      "illustr": 1954,
      "##ited": 1955,
      "##acks": 1956,
      "dr": 1957,
      "drop": 1958,
      "far": 1959,
      "##word": 1960,
      "##nto": 1961,
      "##adem": 1962,
      "self": 1963,
      "##cope": 1964,
      "vari": 1965,
      "argu": 1966,
      "motiv": 1967,
      "material": 1968,
      "inher": 1969,
      "##graph": 1970,
      "assist": 1971,
      "academ": 1972,
      "bra": 1973,
      "hint": 1974,
      "##cing": 1975,
      "##fully": 1976,
      "sell": 1977,
      "##clud": 1978,
      "question": 1979,
      "survey": 1980,
      "suppress": 1981,
      "ll": 1982,
      "sign": 1983,
      "##vent": 1984,
      "extend": 1985,
      "blank": 1986,
      "due": 1987,
      "walk": 1988,
      "##onnected": 1989,
      "##stor": 1990,
      "##oup": 1991,
      "except": 1992,
      "advant": 1993,
      "similar": 1994,
      "rest": 1995,
      "internal": 1996,
      "shift": 1997,
      "exact": 1998,
      "conscious": 1999,
      "explan": 2000,
      "happen": 2001,
      "inherit": 2002,
      "ci": 2003,
      "cap": 2004,
      "##min": 2005,
      "##math": 2006,
      "##mend": 2007,
      "isn": 2008,
      "lines": 2009,
      "specify": 2010,
      "doesn": 2011,
      "probabil": 2012,
      "simplify": 2013,
      "onto": 2014,
      "pers": 2015,
      "##de": 2016,
      "added": 2017,
      "depends": 2018,
      "weiss": 2019,
      "gets": 2020,
      "leaves": 2021,
      "enough": 2022,
      "bytes": 2023,
      "overview": 2024,
      "programmer": 2025,
      "defined": 2026,
      "equality": 2027,
      "projects": 2028,
      "copying": 2029,
      "discussed": 2030,
      "describe": 2031,
      "larger": 2032,
      "activity": 2033,
      "provides": 2034,
      "assignment": 2035,
      "updated": 2036,
      "statements": 2037,
      "changes": 2038,
      "executed": 2039,
      "software": 2040,
      "assume": 2041,
      "repeatedly": 2042,
      "academic": 2043,
      "inheritance": 2044,
      "probabilistic": 2045,
      "03": 2046,
      "37": 2047,
      "tation": 2048,
      "𝑛𝑛": 2049,
      "##obj": 2050,
      "##wor": 2051,
      "tost": 2052,
      "inorder": 2053,
      "##ison": 2054,
      "javac": 2055,
      "printmath": 2056,
      "implemen": 2057,
      "getstor": 2058,
      "cs2": 2059,
      "binarysearch": 2060,
      "postorder": 2061,
      "##edobject": 2062,
      "omicron": 2063,
      "printmathtree": 2064,
      "getstoredobject": 2065,
      "##erv": 2066,
      "ca": 2067,
      "dra": 2068,
      "##inc": 2069,
      "perm": 2070,
      "##ience": 2071,
      "##land": 2072,
      "stand": 2073,
      "##aring": 2074,
      "product": 2075,
      "degener": 2076,
      "bre": 2077,
      "##mark": 2078,
      "##mmend": 2079,
      "##war": 2080,
      "##way": 2081,
      "recommend": 2082,
      "condition": 2083,
      "hunt": 2084,
      "reach": 2085,
      "expans": 2086,
      "content": 2087,
      "bene": 2088,
      "neighbor": 2089,
      "dist": 2090,
      "ok": 2091,
      "##ged": 2092,
      "##ux": 2093,
      "##ets": 2094,
      "explain": 2095,
      "##add": 2096,
      "##iend": 2097,
      "##ibly": 2098,
      "cle": 2099,
      "ve": 2100,
      "##to": 2101,
      "##arr": 2102,
      "along": 2103,
      "subm": 2104,
      "obs": 2105,
      "##king": 2106,
      "links": 2107,
      "compared": 2108,
      "specified": 2109,
      "representation": 2110,
      "solve": 2111,
      "shortest": 2112,
      "considered": 2113,
      "reasonable": 2114,
      "degenerate": 2115,
      "22": 2116,
      "##ww": 2117,
      "ans": 2118,
      "##velo": 2119,
      "exam": 2120,
      "##ided": 2121,
      "##arly": 2122,
      "##uled": 2123,
      "overr": 2124,
      "tell": 2125,
      "group": 2126,
      "##ton": 2127,
      "##pr": 2128,
      "##ber": 2129,
      "##ats": 2130,
      "individ": 2131,
      "##most": 2132,
      "##tern": 2133,
      "##nings": 2134,
      "interview": 2135,
      "care": 2136,
      "wa": 2137,
      "##rees": 2138,
      "##ulation": 2139,
      "##inders": 2140,
      "individual": 2141,
      "could": 2142,
      "ple": 2143,
      "##hes": 2144,
      "##ood": 2145,
      "##ove": 2146,
      "att": 2147,
      "might": 2148,
      "##ni": 2149,
      "##gle": 2150,
      "##rec": 2151,
      "enc": 2152,
      "impro": 2153,
      "via": 2154,
      "##name": 2155,
      "##vis": 2156,
      "##pa": 2157,
      "reus": 2158,
      "##imin": 2159,
      "nos": 2160,
      "param": 2161,
      "##after": 2162,
      "##track": 2163,
      "hc": 2164,
      "hon": 2165,
      "www": 2166,
      "##iting": 2167,
      "clos": 2168,
      "##ints": 2169,
      "poly": 2170,
      "notice": 2171,
      "##metic": 2172,
      "recap": 2173,
      "ident": 2174,
      "increment": 2175,
      "rule": 2176,
      "##sh": 2177,
      "##umb": 2178,
      "##ined": 2179,
      "third": 2180,
      "socr": 2181,
      "synt": 2182,
      "compon": 2183,
      "backtrack": 2184,
      "keyword": 2185,
      "##irected": 2186,
      "huge": 2187,
      "2h": 2188,
      "c1": 2189,
      "fre": 2190,
      "lacks": 2191,
      "net": 2192,
      "arith": 2193,
      "adds": 2194,
      "develo": 2195,
      "treasure": 2196,
      "implementations": 2197,
      "removed": 2198,
      "tracing": 2199,
      "analyze": 2200,
      "anywhere": 2201,
      "upside": 2202,
      "above": 2203,
      "priorities": 2204,
      "created": 2205,
      "storing": 2206,
      "api": 2207,
      "disconnected": 2208,
      "represented": 2209,
      "probing": 2210,
      "application": 2211,
      "allocating": 2212,
      "lots": 2213,
      "helpful": 2214,
      "reminders": 2215,
      "freeing": 2216,
      "smaller": 2217,
      "raise": 2218,
      "possibly": 2219,
      "debugging": 2220,
      "version": 2221,
      "arguments": 2222,
      "assistance": 2223,
      "recommended": 2224,
      "benefits": 2225,
      "socrates": 2226,
      "arithmetic": 2227,
      "300": 2228,
      "45": 2229,
      "55": 2230,
      "67": 2231,
      "cf": 2232,
      "l0": 2233,
      "sin": 2234,
      "##cest": 2235,
      "classname": 2236,
      "sever": 2237,
      "printf": 2238,
      "undirected": 2239,
      "##uchelement": 2240,
      "factorial": 2241,
      "lifo": 2242,
      "gradescope": 2243,
      "sellable": 2244,
      "suppresswar": 2245,
      "cs211": 2246,
      "reusability": 2247,
      "nosuchelement": 2248,
      "suppresswarnings": 2249,
      "nosuchelementexception": 2250,
      "##pect": 2251,
      "general": 2252,
      "ob": 2253,
      "pat": 2254,
      "##yle": 2255,
      "##lex": 2256,
      "##aces": 2257,
      "##self": 2258,
      "quad": 2259,
      "##play": 2260,
      "full": 2261,
      "bar": 2262,
      "sn": 2263,
      "##ys": 2264,
      "##hs": 2265,
      "##ites": 2266,
      "##itch": 2267,
      "##ade": 2268,
      "##ili": 2269,
      "##aining": 2270,
      "manag": 2271,
      "lib": 2272,
      "##ura": 2273,
      "##edi": 2274,
      "reg": 2275,
      "unf": 2276,
      "goo": 2277,
      "hum": 2278,
      "sib": 2279,
      "##ffer": 2280,
      "includ": 2281,
      "ancest": 2282,
      "pros": 2283,
      "dec": 2284,
      "cho": 2285,
      "##ators": 2286,
      "je": 2287,
      "times": 2288,
      "##ties": 2289,
      "##fg": 2290,
      "##oun": 2291,
      "assum": 2292,
      "repl": 2293,
      "measure": 2294,
      "improve": 2295,
      "ways": 2296,
      "##ann": 2297,
      "comb": 2298,
      "##ection": 2299,
      "prof": 2300,
      "##iendly": 2301,
      "##ament": 2302,
      "itself": 2303,
      "##ott": 2304,
